renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
 * No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
 * applicable laws, including copyright laws. 
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO 
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the 
 * following link:
 * http://www.renesas.com/disclaimer 
 *
 * Copyright (C) 2013(2019) Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_riic_rx.c
 * Description  : Functions for using RIIC on RX devices. 
 **********************************************************************************************************************/
/**********************************************************************************************************************
 * History      : DD.MM.YYYY Version  Description
 *              : 01.07.2013 1.00     First Release
 *              : 30.09.2013 1.10     Change symbol of return value and status
 *              : 08.10.2013 1.20     Modified processing for the I/O register initialization and mode transition 
 *                                     when a stop condition is detected while the slave is communicating.
 *                                    Modified processing for mode transition when an API function is called
 *                                     while the bus is busy.
 *                                    Modified processing for mode transition
 *                                     when an arbitration lost occurred and the addresses do not match.
 *                                    Modified incorrect slave transmission after the master reception.
 *                                    Modified processing for the I/O register initialization
 *                                     when generating a start condition and receiving the slave address.
 *              : 17.07.2014 1.30     Added the processes for the timeout detection.
 *                                    Added the call back function for the timeout detection.
 *                                    The number of channels varies depending on the MCU.
 *                                    Therefore, process for each channel is set 
 *                                    in the source file(r_riic_rx###.c) for each MCU folder
 *                                    instead of this file.
 *                                    Similarly, PORT register, ICU register, SYSTEM register also varies
 *                                    depending on the MCU.
 *                                    Therefore, process for port function assignment and interrupt settings
 *                                    and module stop enable/disble is set in the source file(r_riic_rx###.c) 
 *                                    for each MCU folder instead of this file.
 *                                    (### is 111 or 64m)
 *              : 22.09.2014 1.40     The module is updated to measure the issue that slave communication 
 *                                    is not available after an arbitration-lost occurs and the bus is locked. 
 *                                      The issue occurs when the following four conditions are all met.
 *                                         - RIIC FIT module rev. 1.30 or earlier is used.
 *                                         - RX device operates as both the master and the slave 
 *                                           in multi-master communication.
 *                                         - An arbitration-lost is detected when communicating as the master.
 *                                         - Communication other than master reception or slave reception is performed.
 *              : 14.11.2014 1.50     Added RX113 support.
 *              : 09.10.2014 1.60     Added RX71M support.
 *              : 20.10.2014 1.70     Added RX231 support.
 *              : 31.10.2015 1.80     Added RX130, RX230, RX23T support.
 *              : 04.03.2016 1.90     Added RX24T support.
 *                                    Modified calculation processing for ICBRH and ICBRL registers value
 *              : 01.10.2016 2.00     Fixed a program according to the Renesas coding rules.
 *              : 02.06.2017 2.10     Deleted interrupt functions of RIIC3.
 *                                    Fixed processing of the riic_bps_calc function.
 *              : 27.04.2018 2.30     Added "for", "while" and "do while" comment.
 *              : 15.10.2018 2.40     Added RX72T support.
 *              : 04.04.2019 2.41     Added support for GNUC and ICCRX.
 *                                    Fixed coding style.
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Defines for RIIC support */
#include "r_riic_rx_if.h"
#include "r_riic_rx_private.h"

