renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
Exported global variables (to be accessed by other files)
***********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*   riic infomation                                                          */
/*----------------------------------------------------------------------------*/
riic_ch_dev_status_t g_riic_ChStatus[MAX_RIIC_CH_NUM]; /* Channel status */

/*----------------------------------------------------------------------------*/
/*   Callback function                                                        */
/*----------------------------------------------------------------------------*/
volatile riic_callback g_riic_callbackfunc_m[MAX_RIIC_CH_NUM];
volatile riic_callback g_riic_callbackfunc_s[MAX_RIIC_CH_NUM];

/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*   riic infomation                                                          */
/*----------------------------------------------------------------------------*/
static riic_info_t * priic_info_m[MAX_RIIC_CH_NUM]; /* IIC driver information */
static riic_info_t * priic_info_s[MAX_RIIC_CH_NUM]; /* IIC driver information */

static riic_api_event_t riic_api_event[MAX_RIIC_CH_NUM]; /* Event flag */
static riic_api_info_t riic_api_info[MAX_RIIC_CH_NUM]; /* Internal status management */

/*----------------------------------------------------------------------------*/
/*   Main processing of RIIC Driver API functions                             */
/*----------------------------------------------------------------------------*/
static riic_return_t riic_open (riic_info_t *);
static riic_return_t riic_master_send (riic_info_t *);
static riic_return_t riic_master_receive (riic_info_t *);
static riic_return_t riic_master_send_receive (riic_info_t *);
static riic_return_t riic_slave_transfer (riic_info_t *);
static void riic_getstatus (riic_info_t *, riic_mcu_status_t *);
static riic_return_t riic_control (riic_info_t *, uint8_t ctrl_ptn);
static void riic_close (riic_info_t *);
static riic_return_t r_riic_advance (riic_info_t *);
static riic_return_t riic_advance (riic_info_t *);

/*----------------------------------------------------------------------------*/
/*   Called from function table                                               */
/*----------------------------------------------------------------------------*/
static riic_return_t riic_func_table (riic_api_event_t, riic_info_t *);
static riic_return_t riic_init_driver (riic_info_t *);
static riic_return_t riic_generate_start_cond (riic_info_t *);
static riic_return_t riic_after_gen_start_cond (riic_info_t *);
static riic_return_t riic_after_send_slvadr (riic_info_t *);
static riic_return_t riic_after_receive_slvadr (riic_info_t *);
static riic_return_t riic_write_data_sending (riic_info_t *);
static riic_return_t riic_read_data_receiving (riic_info_t *);
static riic_return_t riic_after_dtct_stop_cond (riic_info_t *);
static riic_return_t riic_arbitration_lost (riic_info_t *);
static riic_return_t riic_nack (riic_info_t *);
static riic_return_t riic_enable_slave_transfer (riic_info_t *);
static riic_return_t riic_time_out (riic_info_t *);

/*----------------------------------------------------------------------------*/
/*   Other function                                                           */
/*----------------------------------------------------------------------------*/
static void riic_api_mode_event_init (riic_info_t *, riic_api_mode_t);
static void riic_api_mode_set (riic_info_t *, riic_api_mode_t);
static void riic_api_status_set (riic_info_t *, riic_api_status_t);
static void riic_set_ch_status (riic_info_t *, riic_ch_dev_status_t);
static riic_return_t riic_check_chstatus_start (riic_info_t *);
static riic_return_t riic_check_chstatus_advance (riic_info_t *);
static void riic_enable (riic_info_t *);
static void riic_disable (riic_info_t *);
static void riic_init_io_register (riic_info_t *);
static void riic_slv_addr_match_int_enable (riic_info_t *);
static void riic_int_enable (riic_info_t *);
static void riic_int_disable (riic_info_t *);
static void riic_int_icier_setting (riic_info_t *, uint8_t New_icier);
static void riic_set_frequency (riic_info_t *);
static bool riic_check_bus_busy (riic_info_t *);
static void riic_start_cond_generate (riic_info_t *);
static void riic_re_start_cond_generate (riic_info_t *);
static void riic_stop_cond_generate (riic_info_t *);
static void riic_set_sending_data (riic_info_t *, uint8_t *p_data);
static uint8_t riic_get_receiving_data (riic_info_t *);
static void riic_receive_wait_setting (riic_info_t *);
static void riic_receive_pre_end_setting (riic_info_t *);
static void riic_receive_end_setting (riic_info_t *);
static void riic_reset_clear (riic_info_t *);
static void riic_reset_set (riic_info_t *);
static void riic_all_reset (riic_info_t *);
static void riic_clear_ir_flag (riic_info_t *);

static riic_return_t riic_bps_calc (riic_info_t *, uint16_t kbps);

/* static double riic_check_freq(void); */

#ifdef TN_RXA012A
static void riic_timeout_counter_clear (uint8_t channel);
#endif

/*----------------------------------------------------------------------------*/
/*   function table                                                           */
/*----------------------------------------------------------------------------*/
static const riic_mtx_t gc_riic_mtx_tbl[RIIC_STS_MAX][RIIC_EV_MAX] =
{
    /* Uninitialized state */
    {
        { RIIC_EV_INIT, riic_init_driver }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, NULL }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, NULL }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, NULL }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, NULL }, /* Time out Interrupt */
    },

    /* Idle state */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, riic_enable_slave_transfer }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, riic_generate_start_cond }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, NULL }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, NULL }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, NULL }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, NULL }, /* Time out Interrupt */
    },

    /* Idle state on enable slave transfer */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, riic_generate_start_cond }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, riic_after_receive_slvadr }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, riic_after_receive_slvadr }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, NULL }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, NULL }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, NULL }, /* Time out Interrupt */
    },

    /* Start condition generation completion wait state */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { RIIC_EV_INT_START, riic_after_gen_start_cond }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, NULL }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, riic_arbitration_lost }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, riic_nack }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, riic_time_out }, /* Time out Interrupt */
    },

    /* Slave address [Write] transmission completion wait state */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, riic_after_send_slvadr }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, NULL }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, riic_arbitration_lost }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, riic_nack }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, riic_time_out }, /* Time out Interrupt */
    },

    /* Slave address [Read] transmission completion wait state */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, riic_after_send_slvadr }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt  */
        { RIIC_EV_INT_AL, riic_arbitration_lost }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, riic_nack }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, riic_time_out }, /* Time out Interrupt */
    },

    /* Data transmission completion wait state */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, riic_write_data_sending }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, NULL }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, riic_arbitration_lost }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, riic_nack }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, riic_time_out }, /* Time out Interrupt */
    },

