renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    /* Data reception completion wait state */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, riic_read_data_receiving }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, riic_arbitration_lost }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, riic_nack }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, riic_time_out }, /* Time out Interrupt */
    },

    /* Stop condition generation completion wait state */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, NULL }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, riic_after_dtct_stop_cond }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, NULL }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, riic_nack }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, riic_time_out }, /* Time out Interrupt */
    },
};

/***********************************************************************************************************************
 * Function Name: R_RIIC_Open
 * Description  : Initializes the RIIC driver. Initializes the I/O register for RIIC control.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_LOCK_FUNC             ; Another task is handling API function
 *              : RIIC_ERR_INVALID_CHAN          ; channel number invalid for part
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
riic_return_t R_RIIC_Open (riic_info_t * p_riic_info)
{
    bool chk = RIIC_FALSE;
    riic_return_t ret;

    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)
    if (NULL == p_riic_info)
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }
#endif

    /*  ---- RIIC HARDWARE LOCK ---- */
    chk = riic_mcu_hardware_lock(p_riic_info->ch_no);
    if (RIIC_FALSE == chk)
    {
        /* Lock has already been acquired by another task. Needs to try again later. */
        return RIIC_ERR_LOCK_FUNC;
    }

    /* ---- INITIALIZE RIIC INTERNAL STATUS INFORMATION ---- */
    g_riic_ChStatus[p_riic_info->ch_no] = RIIC_NO_INIT;
    p_riic_info->dev_sts = RIIC_NO_INIT;

    /* ---- INITIALIZE CHANNEL ---- */
    /* Calls the API function. */
    ret = riic_open(p_riic_info);

    return ret;
} /* End of function R_RIIC_Open() */

/***********************************************************************************************************************
 * Function Name: riic_open
 * Description  : sub function of R_RIIC_Open(). Initializes the I/O register for RIIC control.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_open (riic_info_t * p_riic_info)
{
    riic_return_t ret;

    /* Updates the channel status. */
    riic_set_ch_status(p_riic_info, RIIC_IDLE);

    /* Initialize API status on RAM */
    riic_api_mode_event_init(p_riic_info, RIIC_MODE_NONE);

    /* Sets the internal status. (Internal information initialization) */
    riic_api_status_set(p_riic_info, RIIC_STS_NO_INIT);

    /* Enables the IIC peripheral registers. */
    /* Includes I/O register read operation at the end of the following function. */
    /* RIIC HARDWARE ENABLE */
    riic_mcu_power_on(p_riic_info->ch_no);

    /* Initializes the IIC driver. */
    ret = riic_func_table(RIIC_EV_INIT, p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        ret = RIIC_ERR_OTHER;

        /* Updates the channel status. */
        riic_set_ch_status(p_riic_info, RIIC_NO_INIT);
    }
    else
    {
        /* Registers a callback function for supported interrupts. */
        riic_mcu_int_init(p_riic_info->ch_no);

#if (1U == RIIC_CFG_PORT_SET_PROCESSING)
        /* Init Port Processing */
        /* Ports open setting */
        /* Includes I/O register read operation at the end of the following function. */
        riic_mcu_io_open(p_riic_info->ch_no);

        /* Enables RIIC multi-function pin controller. */
        /* Includes I/O register read operation at the end of the following function. */
        riic_mcu_mpc_enable(p_riic_info->ch_no);
#endif
    }

    return ret;
} /* End of function riic_open() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: R_RIIC_MasterSend
 * Description  : Master transmission start processing.
 *                Generates the start condition. Starts the master transmission.
 * Arguments    : riic_info_t * p_riic_info  ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_INVALID_CHAN          ; None existent channel number
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
riic_return_t R_RIIC_MasterSend (riic_info_t * p_riic_info)
{
    riic_return_t ret;

