renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)
    if ((((NULL == p_riic_info) || ((0 == p_riic_info->cnt1st) && ((uint8_t *) FIT_NO_PTR != p_riic_info->p_data1st)))
            || ((0 == p_riic_info->cnt2nd) && ((uint8_t *) FIT_NO_PTR != p_riic_info->p_data2nd)))
            || (NULL == p_riic_info->callbackfunc))
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }
#endif

    /* Calls the API function. */
    ret = riic_master_send(p_riic_info);

    return ret;
} /* End of function R_RIIC_MasterSend() */

/***********************************************************************************************************************
 * Function Name: riic_master_send
 * Description  : sub function of R_RIIC_MasterSend().
 *              : Generates the start condition. Starts the master transmission.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_master_send (riic_info_t * p_riic_info)
{
    riic_return_t ret;
    riic_callback callbackfunc = NULL;

    /* Checks the channel status. */
    ret = riic_check_chstatus_start(p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        return ret;
    }

    /* Updates the channel status. */
    riic_set_ch_status(p_riic_info, RIIC_COMMUNICATION);

    /* Initialize API status on RAM */
    riic_api_mode_event_init(p_riic_info, RIIC_MODE_M_SEND);

    /* Copy p_riic_info address */
    priic_info_m[p_riic_info->ch_no] = p_riic_info;

    /* Sets the callback function. */
    callbackfunc = p_riic_info->callbackfunc;
    g_riic_callbackfunc_m[p_riic_info->ch_no] = callbackfunc;

    /* Generates the start condition.  */
    ret = riic_func_table(RIIC_EV_GEN_START_COND, p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        /* Initialize API status on RAM */
        riic_set_ch_status(p_riic_info, RIIC_IDLE);
        if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
        {
            riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
            riic_api_mode_set(p_riic_info, RIIC_MODE_S_READY);
        }
        else
        {
            riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
        }
    }

    return ret;
} /* End of function riic_master_send() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: R_RIIC_MasterReceive
 * Description  : Master reception start processing.
 *              : Generates the start condition. Starts the master reception.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_INVALID_CHAN          ; None existent channel number
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
riic_return_t R_RIIC_MasterReceive (riic_info_t * p_riic_info)
{
    riic_return_t ret;

    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)
    /* Parameter check */
    if ((((((NULL == p_riic_info) || (NULL == p_riic_info->p_slv_adr))
            || ((0 != p_riic_info->cnt1st) && (NULL == p_riic_info->p_data1st))) || (NULL == p_riic_info->p_data2nd))
            || (0 == p_riic_info->cnt2nd)) || (NULL == p_riic_info->callbackfunc))
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }

#endif

    if (0 == p_riic_info->cnt1st)
    {
        /* Calls the API function. */
        ret = riic_master_receive(p_riic_info);
    }
    else
    {
        /* Calls the API function. */
        ret = riic_master_send_receive(p_riic_info);
    }

    return ret;
} /* End of function R_RIIC_MasterReceive() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: riic_master_receive
 * Description  : sub function of R_RIIC_MasterReceive(). 
 *              : Generates the start condition. Starts the master reception.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_master_receive (riic_info_t * p_riic_info)
{
    riic_return_t ret;
    riic_callback callbackfunc = NULL;

    /* Checks the channel status. */
    ret = riic_check_chstatus_start(p_riic_info);

