renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    if (RIIC_SUCCESS != ret)
    {
        return ret;
    }

    if (RIIC_MODE_S_READY != riic_api_info[p_riic_info->ch_no].N_Mode)
    {
        /* Updates the channel status. */
        riic_set_ch_status(p_riic_info, RIIC_IDLE);

        /* Initialize API status on RAM */
        riic_api_mode_event_init(p_riic_info, RIIC_MODE_S_READY);

        /* Generates the start condition. */
        ret = riic_func_table(RIIC_EV_EN_SLV_TRANSFER, p_riic_info);
    }

    /* Copy p_riic_info address */
    priic_info_s[p_riic_info->ch_no] = p_riic_info;

    /* Sets the callback function. */
    callbackfunc = p_riic_info->callbackfunc;
    g_riic_callbackfunc_s[p_riic_info->ch_no] = callbackfunc;

    /* ---- Enables IIC bus interrupt enable register. ---- */
    if (((uint8_t *) FIT_NO_PTR != p_riic_info->p_data1st) && ((uint8_t *) FIT_NO_PTR != p_riic_info->p_data2nd))
    {
        /* Enables slave send and slave receive */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_TX_RX);
    }
    else if (((uint8_t *) FIT_NO_PTR != p_riic_info->p_data1st) && ((uint8_t *) FIT_NO_PTR == p_riic_info->p_data2nd))
    {
        /* Enable slave send */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_TX);
    }
    else if (((uint8_t *) FIT_NO_PTR == p_riic_info->p_data1st) && ((uint8_t *) FIT_NO_PTR != p_riic_info->p_data2nd))
    {
        /* Enable slave receive */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_RX);
    }
    else
    {
        /* Do Nothing */
    }

    return ret;
} /* End of function riic_slave_transfer() */

/***********************************************************************************************************************
 * Function Name: R_RIIC_GetStatus
 * Description  : get status of this RIIC module. 
 *                Returns the state of this module.
 *                Obtains the state of the RIIC channel, which specified by the parameter, by reading the register,
 *                variable, or others, and returns the obtained state as 32-bit structure.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 *                riic_mcu_status_t * p_riic_status ; The address to store the I2C state flag.
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_INVALID_CHAN          ; channel number invalid for part
 **********************************************************************************************************************/
riic_return_t R_RIIC_GetStatus (riic_info_t *p_riic_info, riic_mcu_status_t *p_riic_status)
{
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)

    if ((NULL == p_riic_info) || (NULL == p_riic_status))
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }

#endif

    /* Calls the API function. */
    riic_getstatus(p_riic_info, p_riic_status);

    return RIIC_SUCCESS;
} /* End of function R_RIIC_GetStatus() */

/***********************************************************************************************************************
 * Function Name: riic_getstatus
 * Description  : sub function of R_RIIC_GetStatus.
 *                Returns the state of this module.
 *                Obtains the state of the RIIC channel, which specified by the parameter, by reading the register,
 *                variable, or others, and returns the obtained state as 32-bit structure.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 *                riic_mcu_status_t * p_riic_status ; The address to store the I2C state flag.
 * Return Value : none
 **********************************************************************************************************************/
static void riic_getstatus (riic_info_t *p_riic_info, riic_mcu_status_t *p_riic_status)
{
    volatile uint8_t uctmp = 0x00;
    volatile riic_mcu_status_t sts_flag;
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picsr1_reg = RIIC_ICSR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);

    sts_flag.LONG = 0x00000000;

    /* ---- Check Bus state ---- */
    if (RIIC_ICCR2_BBSY_SET == ((*piccr2_reg) & RIIC_ICCR2_BBSY))
    {
        sts_flag.BIT.BSY = 1U;
    }
    else
    {
        sts_flag.BIT.BSY = 0U;
    }

    /* ---- Check Mode ---- */
    if (RIIC_ICCR2_TRS_SET == ((*piccr2_reg) & RIIC_ICCR2_TRS))
    {
        /* Send */
        sts_flag.BIT.TRS = 1U;
    }
    else
    {
        /* Receive */
        sts_flag.BIT.TRS = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_NACKF_SET == ((*picsr2_reg) & RIIC_ICSR2_NACKF))
    {
        /* NACK translation detected*/
        sts_flag.BIT.NACK = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.NACK = 0U;
    }

    /* ---- Check Send buffer status ---- */
    if (RIIC_ICSR2_TDRE_SET == ((*picsr2_reg) & RIIC_ICSR2_TDRE))
    {
        /* Send buffer empty */
        sts_flag.BIT.SBUF = 1U;
    }
    else
    {
        /* Send buffer not empty */
        sts_flag.BIT.SBUF = 0U;
    }

    /* ---- Check Receive buffer status ---- */
    if (RIIC_ICSR2_RDRF_SET == ((*picsr2_reg) & RIIC_ICSR2_RDRF))
    {
        /* Receive buffer not empty */
        sts_flag.BIT.RBUF = 1U;
    }
    else
    {
        /* Receive buffer empty */
        sts_flag.BIT.RBUF = 0U;
    }

    /* ---- Check SDA pin level ---- */
    if (RIIC_ICCR1_SDAI_SET == ((*piccr1_reg) & RIIC_ICCR1_SDAI))
    {
        /* SDA pin is High level */
        sts_flag.BIT.SDAI = 1U;
    }
    else
    {
        /* SDA pin is Low level */
        sts_flag.BIT.SDAI = 0U;
    }

    /* ---- Check SCL pin level ---- */
    if (RIIC_ICCR1_SCLI_SET == ((*piccr1_reg) & RIIC_ICCR1_SCLI))
    {
        /* SCL pin is High level */
        sts_flag.BIT.SCLI = 1U;
    }
    else
    {
        /* SCL pin is Low level */
        sts_flag.BIT.SCLI = 0U;
    }

    /* ---- Check SDA output control status ---- */
    if (RIIC_ICCR1_SDAO_SET == ((*piccr1_reg) & RIIC_ICCR1_SDAO))
    {
        /* SDA pin is Open */
        sts_flag.BIT.SDAO = 1U;
    }
    else
    {
        /* SDA pin is Low hold */
        sts_flag.BIT.SDAO = 0U;
    }

    /* ---- Check SCL output control status ---- */
    if (RIIC_ICCR1_SCLO_SET == ((*piccr1_reg) & RIIC_ICCR1_SCLO))
    {
        /* SCL pin is Open */
        sts_flag.BIT.SCLO = 1U;
    }
    else
    {
        /* SCL pin is Low hold */
        sts_flag.BIT.SCLO = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_START_SET == ((*picsr2_reg) & RIIC_ICSR2_START))
    {
        /* Start condition detected*/
        sts_flag.BIT.ST = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.ST = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_STOP_SET == ((*picsr2_reg) & RIIC_ICSR2_STOP))
    {
        /* Stop condition detected*/
        sts_flag.BIT.SP = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.SP = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_AL_SET == ((*picsr2_reg) & RIIC_ICSR2_AL))
    {
        /* Arbitration lost detected*/
        sts_flag.BIT.AL = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.AL = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_TMOF_SET == ((*picsr2_reg) & RIIC_ICSR2_TMOF))
    {
        /* Time out detected*/
        sts_flag.BIT.TMO = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.TMO = 0U;
    }

    /* ---- Check Master/Slave Mode ---- */
    if (RIIC_ICCR2_MST_SET == ((*piccr2_reg) & RIIC_ICCR2_MST))
    {
        /* Master Mode */
        sts_flag.BIT.MST = 1U;
    }
    else
    {
        /* Slave Mode */
        sts_flag.BIT.MST = 0U;
    }

    /* ---- Check Host Address detection ---- */
    if (RIIC_ICSR1_HOA_SET == ((*picsr1_reg) & RIIC_ICSR1_HOA))
    {
        /* Host Address detected */
        sts_flag.BIT.HOA = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.HOA = 0U;
    }

