renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    /* ---- Check Device ID Address detection ---- */
    if (RIIC_ICSR1_DID_SET == ((*picsr1_reg) & RIIC_ICSR1_DID))
    {
        /* Device ID Address detected */
        sts_flag.BIT.DID = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.DID = 0U;
    }

    /* ---- Check Generalcall Address detection ---- */
    if (RIIC_ICSR1_GCA_SET == ((*picsr1_reg) & RIIC_ICSR1_GCA))
    {
        /* Generalcall Address detected */
        sts_flag.BIT.GCA = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.GCA = 0U;
    }

    /* ---- Check Slave0 Address detection ---- */
    if (RIIC_ICSR1_AAS0_SET == ((*picsr1_reg) & RIIC_ICSR1_AAS0))
    {
        /* Slave0 Address detected */
        sts_flag.BIT.AAS0 = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.AAS0 = 0U;
    }

    /* ---- Check Slave1 Address detection ---- */
    if (RIIC_ICSR1_AAS1_SET == ((*picsr1_reg) & RIIC_ICSR1_AAS1))
    {
        /* Slave1 Address detected */
        sts_flag.BIT.AAS1 = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.AAS1 = 0U;
    }

    /* ---- Check Slave2 Address detection ---- */
    if (RIIC_ICSR1_AAS2_SET == ((*picsr1_reg) & RIIC_ICSR1_AAS2))
    {
        /* Slave2 Address detected */
        sts_flag.BIT.AAS2 = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.AAS2 = 0U;
    }

    /* ---- Set the state ---- */
    *p_riic_status = sts_flag;

    /* ---- clear flag ---- */
    (*picsr2_reg) &= RIIC_ICSR2_AL_CLR;
    (*picsr2_reg) &= RIIC_ICSR2_NACKF_CLR;
    uctmp = *picsr2_reg;

    if (RIIC_AL == g_riic_ChStatus[p_riic_info->ch_no])
    {
        /* Initialize the channel status. */
        riic_set_ch_status(p_riic_info, RIIC_FINISH);
    }
} /* End of function riic_getstatus() */

/***********************************************************************************************************************
 * Function Name: R_RIIC_Control
 * Description  : RIIC scl sda control processing.
 *                This function is mainly used when a communication error occurs.
 *                Outputs control signals of the simple I2C mode.
 *                Outputs conditions specified by the argument, NACK,
 *                and one-shot of the SSCL clock. Also resets the simple I2C mode settings.
 * Arguments    : r_iic_info_t * p_r_iic_info    ; IIC Information
 *                uint8_t cntl_ptn               ; Output Pattern
 *                 [Options]
 *                  RIIC_GEN_START_CON
 *                  RIIC_GEN_STOP_CON
 *                  RIIC_GEN_RESTART_CON 
 *                  RIIC_GEN_SDA_HI_Z
 *                  RIIC_GEN_SCL_ONESHOT
 *                  RIIC_GEN_RESET
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_INVALID_CHAN          ; None existent channel number
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
riic_return_t R_RIIC_Control (riic_info_t * p_riic_info, uint8_t ctrl_ptn)
{
    riic_return_t ret;

    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)

    if ((NULL == p_riic_info) || (0 == ctrl_ptn))
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }

#endif

    /* Calls the API function. */
    ret = riic_control(p_riic_info, ctrl_ptn);

    return ret;
} /* End of function R_RIIC_Control() */

/***********************************************************************************************************************
 * Function Name: riic_control
 * Description  : sub function of R_RIIC_Control.
 *                This function is mainly used when a communication error occurs.
 *                Outputs control signals of the simple I2C mode.
 *                Outputs conditions specified by the argument, NACK,
 *                and one-shot of the SSCL clock. Also resets the simple I2C mode settings.
 * Arguments    : r_iic_info_t * p_riic_info     ; IIC Information
 *                uint8_t cntl_ptn               ; Output Pattern
 *                 [Options]
 *                  RIIC_GEN_START_CON
 *                  RIIC_GEN_STOP_CON
 *                  RIIC_GEN_RESTART_CON 
 *                  RIIC_GEN_SDA_HI_Z
 *                  RIIC_GEN_SCL_ONESHOT
 *                  RIIC_GEN_RESET
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_control (riic_info_t * p_riic_info, uint8_t ctrl_ptn)
{
    volatile riic_return_t ret = RIIC_SUCCESS;
    volatile uint8_t uctmp = 0x00;
    volatile uint32_t cnt = 0x00000000;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Disable all RIIC interrupt */
    riic_int_disable(p_riic_info);

    /* ==== Release reset(IICRST) of RIIC ==== */
    riic_reset_clear(p_riic_info);

    if (RIIC_ICCR1_ICE_SET != ((*piccr1_reg) & RIIC_ICCR1_ICE)) /* Check ICCR1.ICE = 0 */
    {
        /* Set ICE bit to enable RIIC modeule */
        (*piccr1_reg) |= RIIC_ICCR1_ICE_SET;
    }

    if ((0 != (uint8_t) (((RIIC_GEN_START_CON | RIIC_GEN_RESTART_CON) | RIIC_GEN_STOP_CON) & ctrl_ptn))
            && (0 == (uint8_t) (((RIIC_GEN_SDA_HI_Z | RIIC_GEN_SCL_ONESHOT) | RIIC_GEN_RESET) & ctrl_ptn)))
    {
        /* ==== Check request output pattern ==== */
        /* ---- Generate the start condition ---- */
        if (RIIC_GEN_START_CON == (ctrl_ptn & RIIC_GEN_START_CON))
        {
            /* Checks bus busy. */
            if (RIIC_ICCR2_BBSY_SET == ((*piccr2_reg) & RIIC_ICCR2_BBSY))
            {
                /* When BBSY bit is "1"(Bus busy) */
                ret = RIIC_ERR_BUS_BUSY;
                return ret;
            }

