renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
            /* Generates the start condition. */
            riic_start_cond_generate(p_riic_info);

            /* Wait the request generation has been completed */
            cnt = RIIC_CFG_BUS_CHECK_COUNTER;
            /* WAIT_LOOP */
            while (RIIC_ICSR2_START_SET != ((*picsr2_reg) & RIIC_ICSR2_START))
            {
                /* Check Arbitration */
                if (RIIC_ICSR2_AL_SET == ((*picsr2_reg) & RIIC_ICSR2_AL))
                {
                    /* When AL bit is "1" */
                    ret = RIIC_ERR_AL;
                    return ret;
                }

                /* Check Reply */
                if (0x00000000 < cnt)
                {
                    cnt--;
                }
                else
                {
                    /* When Non Reply */
                    ret = RIIC_ERR_BUS_BUSY;
                    return ret;
                }
            }

            /* Clear START detect bit */
            (*picsr2_reg) &= RIIC_ICSR2_START_CLR;
        }

        /* ---- Generate the restart condition ---- */
        if (RIIC_GEN_RESTART_CON == (ctrl_ptn & RIIC_GEN_RESTART_CON))
        {
            /* Checks bus busy. */
            if (RIIC_ICCR2_BBSY_SET != ((*piccr2_reg) & RIIC_ICCR2_BBSY))
            {
                /* When BBSY bit is "0"(Not Bus busy) */
                ret = RIIC_ERR_OTHER;
                return ret;
            }

            /* Generates the restart condition. */
            riic_re_start_cond_generate(p_riic_info);

            /* Wait the request generation has been completed*/
            cnt = RIIC_CFG_BUS_CHECK_COUNTER;
            /* WAIT_LOOP */
            while (RIIC_ICSR2_START_SET != ((*picsr2_reg) & RIIC_ICSR2_START))
            {
                /* Check Arbitration */
                if (RIIC_ICSR2_AL_SET == ((*picsr2_reg) & RIIC_ICSR2_AL))
                {
                    /* When AL bit is "1" */
                    ret = RIIC_ERR_AL;
                    return ret;
                }

                /* Check Reply */
                if (0x00000000 < cnt)
                {
                    cnt--;
                }
                else
                {
                    /* When Non Reply */
                    ret = RIIC_ERR_BUS_BUSY;
                    return ret;
                }
            }

            /* Clear START detect bit */
            (*picsr2_reg) &= RIIC_ICSR2_START_CLR;
        }

        /* ---- Generate the stop condition ---- */
        if (RIIC_GEN_STOP_CON == (ctrl_ptn & RIIC_GEN_STOP_CON))
        {
            /* Checks bus busy. */
            if (RIIC_ICCR2_BBSY_SET != ((*piccr2_reg) & RIIC_ICCR2_BBSY))
            {
                /* When BBSY bit is "0"(Not Bus busy) */
                ret = RIIC_ERR_OTHER;
                return ret;
            }

            /* Generates the stop condition. */
            riic_stop_cond_generate(p_riic_info);

            /* Wait the request generation has been completed*/
            cnt = RIIC_CFG_BUS_CHECK_COUNTER;
            /* WAIT_LOOP */
            while (RIIC_ICSR2_STOP_SET != ((*picsr2_reg) & RIIC_ICSR2_STOP))
            {
                /* Check Arbitration */
                if (RIIC_ICSR2_AL_SET == ((*picsr2_reg) & RIIC_ICSR2_AL))
                {
                    /* When AL bit is "1" */
                    ret = RIIC_ERR_AL;
                    return ret;
                }

                /* Check Reply */
                if (0x00000000 < cnt)
                {
                    cnt--;
                }
                else
                {
                    /* When Non Reply */
                    ret = RIIC_ERR_BUS_BUSY;
                    return ret;
                }
            }

            /* Clear STOP detect bit */
            (*picsr2_reg) &= RIIC_ICSR2_STOP_CLR;
        }
    }
    else if ((0x00 != (uint8_t) ((RIIC_GEN_SDA_HI_Z | RIIC_GEN_SCL_ONESHOT) & ctrl_ptn))
            && (0x00 == (uint8_t) ((((RIIC_GEN_START_CON | RIIC_GEN_RESTART_CON) | RIIC_GEN_STOP_CON) |
            RIIC_GEN_RESET) & ctrl_ptn)))
    {
        /* ---- Select SDA pin in a high-impedance state ---- */
        if (RIIC_GEN_SDA_HI_Z == (ctrl_ptn & RIIC_GEN_SDA_HI_Z))
        {
            /* Changes the SDA pin in a high-impedance state. */
            /* Sets for ICCR1.SDAO bit. */
            *piccr1_reg = (uint8_t) (((*piccr1_reg) | RIIC_ICCR1_SDAO_SET) & RIIC_ICCR1_SOWP_CLR);
        }

        /* ---- Generate OneShot of SSCL clock ---- */
        if (RIIC_GEN_SCL_ONESHOT == (ctrl_ptn & RIIC_GEN_SCL_ONESHOT))
        {
            /* Output SCL oneshot */
            (*piccr1_reg) |= RIIC_ICCR1_CLO_SET;

            /* Wait output scl oneshot has been completed */
            cnt = RIIC_CFG_BUS_CHECK_COUNTER;
            /* WAIT_LOOP */
            while (RIIC_ICCR1_CLO_SET == ((*piccr1_reg) & RIIC_ICCR1_CLO_SET))
            {
                /* Check Reply */
                if (0x00000000 < cnt)
                {
                    cnt--;
                }
                else
                {
                    /* Set SCLO bit is "1"(Hi-z). */
                    *piccr1_reg = (uint8_t) (((*piccr1_reg) | RIIC_ICCR1_SCLO_SET) & RIIC_ICCR1_SOWP_CLR);

                    /* When Non Reply */
                    ret = RIIC_ERR_BUS_BUSY;
                    return ret;
                }
            }
        }
    }
    else if ((0x00 != (uint8_t) ((RIIC_GEN_RESET) & ctrl_ptn))
            && (0x00 == (uint8_t) (((((RIIC_GEN_START_CON | RIIC_GEN_RESTART_CON) | RIIC_GEN_STOP_CON) |
            RIIC_GEN_SDA_HI_Z) | RIIC_GEN_SCL_ONESHOT) & ctrl_ptn)))
    {
        /* ---- Generate Reset ---- */
        /* Updates the channel status. */
        riic_set_ch_status(p_riic_info, RIIC_IDLE);

        /* Initialize API status on RAM */
        riic_api_mode_event_init(p_riic_info, RIIC_MODE_NONE);

        /* Initializes the IIC registers. */
        /* Sets the internal status. */
        /* Enables the interrupt. */
        /* Clears the RIIC reset or internal reset. */
        riic_enable(p_riic_info);
    }
    else
    {
        /* parameter error */
        ret = RIIC_ERR_INVALID_ARG;
    }
    uctmp = *piccr1_reg;

    riic_clear_ir_flag(p_riic_info); /* Clear IR flag for RXI and TXI */

    return ret;
} /* End of function riic_control() */

