renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
 * Function Name: R_RIIC_Close
 * Description  : Resets the RIIC driver.
 *              : The processing performs internal reset by setting to ICCR1.IICRST bit.
 *              : Forcibly, stops the IIC communication.
 *              : After called the processing, channel status becomes "RIIC_NO_INIT".
 *              : When starts the communication again, please call an initialization processing.
 * Arguments    : riic_info_t * p_riic_info      ;   IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_INVALID_CHAN          ; channel number invalid for part
 **********************************************************************************************************************/
riic_return_t R_RIIC_Close (riic_info_t * p_riic_info)
{
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)
    if (NULL == p_riic_info)
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }

#endif

    /* ---- Hardware Unlock ---- */
    riic_mcu_hardware_unlock(p_riic_info->ch_no);

    /* Calls the API function. */
    riic_close(p_riic_info);

    return RIIC_SUCCESS;
} /* End of function R_RIIC_Close() */

/***********************************************************************************************************************
 * Function Name: riic_close
 * Description  : sub function of R_RIIC_Close. 
 *                Resets the RIIC driver.
 *              : The processing performs internal reset by setting to ICCR1.IICRST bit.
 *              : Forcibly, stops the IIC communication.
 *              : After called the processing, channel status becomes "RIIC_NO_INIT".
 *              : When starts the communication again, please call an initialization processing.
 * Arguments    : riic_info_t * p_riic_info      ;   IIC Information
 * Return Value : none
 **********************************************************************************************************************/
static void riic_close (riic_info_t * p_riic_info)
{
    /* Updates the channel status. */
    riic_set_ch_status(p_riic_info, RIIC_NO_INIT);

    /* Disables IIC. */
    riic_disable(p_riic_info);

#if (1U == RIIC_CFG_PORT_SET_PROCESSING)
    /* Disables RIIC multi-function pin controller after setting SCL and SDA to Hi-z by Reset. */
    /* Includes I/O register read operation at the end of the following function. */
    riic_mcu_mpc_disable(p_riic_info->ch_no);
#endif

    riic_mcu_power_off(p_riic_info->ch_no);
} /* End of function riic_close() */

/***********************************************************************************************************************
 * Function Name: R_RIIC_GetVersion
 * Description  : Returns the version of this module. The version number is 
 *                encoded such that the top two bytes are the major version
 *                number and the bottom two bytes are the minor version number.
 * Arguments    : none
 * Return Value : version number
 **********************************************************************************************************************/
uint32_t R_RIIC_GetVersion (void)
{
    uint32_t const version = (RIIC_VERSION_MAJOR << 16) | RIIC_VERSION_MINOR;

    return version;
} /* End of function R_RIIC_GetVersion() */

/***********************************************************************************************************************
 * Function Name: r_riic_advance
 * Description  : Advances the IIC communication.
 *              : The return value shows the communication result. Refer to the return value.
 * Arguments    : riic_info_t * p_riic_info     ;   IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t r_riic_advance (riic_info_t * p_riic_info)
{
    riic_return_t ret;

    /* Parameter check */
    if (NULL == p_riic_info)
    {
        ret = RIIC_ERR_INVALID_ARG;
    }
    else
    {
        /* Calls the API function. */
        ret = riic_advance(p_riic_info);
    }

    return ret;
} /* End of function r_riic_advance() */

/***********************************************************************************************************************
 * Function Name: riic_advance
 * Description  : sub function of r_riic_advance.
 *                Advances the IIC communication.
 *              : The return value shows the communication result. Refer to the return value.
 * Arguments    : riic_info_t * p_riic_info     ;   IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_advance (riic_info_t * p_riic_info)
{
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picier_reg = RIIC_ICIER_ADR(p_riic_info->ch_no);
    riic_return_t ret;

    /* Checks the channel status. */
    ret = riic_check_chstatus_advance(p_riic_info);
    if (RIIC_SUCCESS != ret)
    {
        return ret;
    }

    /* Event happened? */
    if (RIIC_EV_INIT != riic_api_event[p_riic_info->ch_no])
    {
        /* IIC communication processing */
        ret = riic_func_table(riic_api_event[p_riic_info->ch_no], p_riic_info);

