renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
        /* return value? */
        switch (ret)
        {
            case RIIC_SUCCESS :
                if (RIIC_STS_TMO == riic_api_info[p_riic_info->ch_no].N_status)
                {
                    /* Checks the callback function. */
                    if ((((((RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].B_Mode))
                            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                    {
                        riic_set_ch_status(priic_info_m[p_riic_info->ch_no], RIIC_TMO);
                        if (NULL != g_riic_callbackfunc_m[p_riic_info->ch_no])
                        {
                            g_riic_callbackfunc_m[p_riic_info->ch_no]();
                        }
                    }

                    if ((RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                    {
                        riic_set_ch_status(priic_info_s[p_riic_info->ch_no], RIIC_TMO);
                        if (NULL != g_riic_callbackfunc_s[p_riic_info->ch_no])
                        {
                            g_riic_callbackfunc_s[p_riic_info->ch_no]();
                        }
                    }
                }

                else if (((RIIC_STS_SP_COND_WAIT != riic_api_info[p_riic_info->ch_no].N_status)
                        || (0x00 != ((*picsr2_reg) & RIIC_ICSR2_STOP))) || (0x00 != ((*picier_reg) & RIIC_ICIER_SP)))
                {
                    /* Advances communication. (Not finished) */
                    /* Do Nothing */
                }
                else
                {
                    /* Finished communication.(after detect stop condition) */
                    /* Updates the channel status. */
                    if (RIIC_ICSR2_AL == ((*picsr2_reg) & RIIC_ICSR2_AL))
                    {
                        if (((RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].N_Mode)
                                || (RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode))
                                || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                        {
                            riic_set_ch_status(priic_info_s[p_riic_info->ch_no], RIIC_FINISH);
                        }

                        riic_set_ch_status(priic_info_m[p_riic_info->ch_no], RIIC_AL);
                    }
                    else if (RIIC_ICSR2_NACKF == ((*picsr2_reg) & RIIC_ICSR2_NACKF))
                    {
                        riic_set_ch_status(p_riic_info, RIIC_NACK);
                    }
                    else
                    {
                        riic_set_ch_status(p_riic_info, RIIC_FINISH);
                    }

                    /* Checks the callback function. */
                    if ((((((RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].B_Mode))
                            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                    {
                        if (NULL != g_riic_callbackfunc_m[p_riic_info->ch_no])
                        {
                            g_riic_callbackfunc_m[p_riic_info->ch_no]();
                        }
                    }

                    if ((RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                    {
                        if (NULL != g_riic_callbackfunc_s[p_riic_info->ch_no])
                        {
                            g_riic_callbackfunc_s[p_riic_info->ch_no]();
                        }
                    }

                    /* Return to the last mode */
                    if ((RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode))
                    {
                        /* Initialize API status on RAM */
                        riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
                        riic_api_mode_set(p_riic_info, RIIC_MODE_S_READY);
                        riic_api_status_set(p_riic_info, RIIC_STS_IDLE_EN_SLV);

                        /* ---- Enables IIC bus interrupt enable register. ---- */
                        if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                                && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                        {
                            /* Enables slave send and slave receive */
                            riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TX_RX);
                        }
                        else if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                                && ((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data2nd))
                        {
                            /* Enable slave send */
                            riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TX);
                        }
                        else if (((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data1st)
                                && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                        {
                            /* Enable slave receive */
                            riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_RX);
                        }
                        else
                        {
                            /* Do Nothing */
                        }
                    }
                    else
                    {
                        /* Initialize API status on RAM */
                        riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
                        riic_api_status_set(p_riic_info, RIIC_STS_IDLE);

                        /* Initializes ICIER register. */
                        *picier_reg = RIIC_ICIER_INIT;
                        /* WAIT_LOOP */
                        while (RIIC_ICIER_INIT != (*picier_reg))
                        {
                            /* Do Nothing */
                        }
                    }
                }
            break;

            default :

                /* Updates the channel status. */
                riic_set_ch_status(p_riic_info, RIIC_ERROR);
            break;
        }
    }

