renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    /* Event nothing. */
    else
    {
        ret = RIIC_ERR_OTHER;
    }

    return ret;
} /* End of function riic_advance() */

/***********************************************************************************************************************
 * Function Name: riic_func_table
 * Description  : IIC Protocol Execution Processing.
 *                Executes the function which set in "pfunc".
 * Arguments    : riic_api_event_t event    ; Event
 *              : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : Refer to the each calling function.
 **********************************************************************************************************************/
static riic_return_t riic_func_table (riic_api_event_t event, riic_info_t * p_riic_info)
{
    riic_return_t ret;
    riic_return_t (*pFunc) (riic_info_t *);
    riic_api_status_t n_status;

    /* Acquires a now state. */
    n_status = riic_api_info[p_riic_info->ch_no].N_status;

    /* Checks the parameter. */
    if ((RIIC_STS_MAX > n_status) && (RIIC_EV_MAX > event))
    {
        /* Checks the appointed function. */
        if (NULL != gc_riic_mtx_tbl[n_status][event].proc)
        {
            /* Sets the function. */
            pFunc = gc_riic_mtx_tbl[n_status][event].proc;

            /* Event flag initialization. */
            riic_api_event[p_riic_info->ch_no] = RIIC_EV_INIT;

            /* Calls the status transition function. */
            ret = (*pFunc)(p_riic_info);
        }
        else
        {
            /* Appointed function error */
            ret = RIIC_ERR_OTHER;
        }
    }
    else
    {
        /* Appointed function error */
        ret = RIIC_ERR_OTHER;
    }

    return ret;
} /* End of function riic_func_table() */

/***********************************************************************************************************************
 * Function Name: riic_init_driver
 * Description  : Initialize IIC Driver Processing.
 *                Initializes the IIC registers.
 *              : Sets the internal status.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, idle state
 **********************************************************************************************************************/
static riic_return_t riic_init_driver (riic_info_t * p_riic_info)
{
    /* Initializes the IIC registers. */
    /* Sets the internal status. */
    /* Enables the interrupt. */
    /* Clears the RIIC reset or internal reset. */
    riic_enable(p_riic_info);

    return RIIC_SUCCESS;
} /* End of function riic_init_driver() */

/***********************************************************************************************************************
 * Function Name: riic_generate_start_cond
 * Description  : Generate Start Condition Processing.
 *                Checks bus busy. Sets the internal status. Generates the start condition.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, communication state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy error
 **********************************************************************************************************************/
static riic_return_t riic_generate_start_cond (riic_info_t * p_riic_info)
{
    riic_return_t ret;
    bool boolret;
    volatile uint8_t uctmp;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picier_reg = RIIC_ICIER_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);

    /* Checks bus busy. */
    boolret = riic_check_bus_busy(p_riic_info);
    if (RIIC_FALSE == boolret)
    {
        ret = RIIC_ERR_BUS_BUSY; /* Bus busy */
    }
    else
    {
        /* Clears each status flag. */
        (*picsr2_reg) &= RIIC_ICSR2_STOP_CLR;
        /* WAIT_LOOP */
        while (0x00 != (((*picsr2_reg) & RIIC_ICSR2_START) || ((*picsr2_reg) & RIIC_ICSR2_STOP)))
        {
            /* Do Nothing */
        }

        /* Sets the internal status. */
        riic_api_status_set(p_riic_info, RIIC_STS_ST_COND_WAIT);

        /* Clears ALIE bit. */
        (*picier_reg) &= (~RIIC_ICIER_AL);
        uctmp = *picier_reg; /* Reads ICIER. */

        /* Enables IIC bus interrupt enable register. */
        if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
        {
            if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                    && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
            {
                /* Enables slave send and slave receive */
                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_ST_NAK_AL | RIIC_ICIER_TX_RX);
            }
            else if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                    && ((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data2nd))
            {
                /* Enable slave send */
                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_ST_NAK_AL | RIIC_ICIER_TX);
            }
            else if (((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data1st)
                    && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
            {
                /* Enable slave receive */
                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_ST_NAK_AL | RIIC_ICIER_RX);
            }
            else
            {
                /* Do Nothing */
            }
        }
        else
        {
            riic_int_icier_setting(p_riic_info, RIIC_ICIER_ST_NAK_AL);
        }

        /* Generates the start condition. */
        riic_start_cond_generate(p_riic_info);

        ret = RIIC_SUCCESS;
    }

    return ret;
} /* End of function riic_generate_start_cond() */

