renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
 * Function Name: riic_after_gen_start_cond
 * Description  : After Start Condition Generation Processing.
 *                Performs one of the following processing according to the state.
 *                Transmits the slave address for writing.
 *                Transmits the slave address for reading.
 *                Generates the stop condition.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, communication state
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_after_gen_start_cond (riic_info_t * p_riic_info)
{
    riic_return_t ret = RIIC_SUCCESS;
    uint8_t buf_send_data;
    volatile uint32_t cnt;
    bool scl_low_chk;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);

    /* IIC mode? */
    switch (riic_api_info[p_riic_info->ch_no].N_Mode)
    {
        case RIIC_MODE_M_SEND :
        case RIIC_MODE_M_SEND_RECEIVE :

            /* Checks the previous status. */
            switch (riic_api_info[p_riic_info->ch_no].B_status)
            {
                /* The previous status is idle. */
                case RIIC_STS_IDLE :
                case RIIC_STS_IDLE_EN_SLV :

                    /* Is the slave address pointer set? */
                    if ((uint8_t *) FIT_NO_PTR == p_riic_info->p_slv_adr) /* Pattern 4 of Master Write */
                    {
                        /* Sets the internal status. */
                        riic_api_status_set(p_riic_info, RIIC_STS_SP_COND_WAIT);

                        /* Enables the IIC bus interrupt. */
                        if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
                        {
                            if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                                    && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                            {
                                /* Enables slave send and slave receive */
                                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_SP_NAK_AL |
                                RIIC_ICIER_TX_RX);
                            }
                            else if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                                    && ((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data2nd))
                            {
                                /* Enable slave send */
                                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_SP_NAK_AL |
                                RIIC_ICIER_TX);
                            }
                            else if (((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data1st)
                                    && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                            {
                                /* Enable slave receive */
                                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_SP_NAK_AL |
                                RIIC_ICIER_RX);
                            }
                            else
                            {
                                /* Do Nothing */
                            }
                        }
                        else
                        {
                            riic_int_icier_setting(p_riic_info, RIIC_ICIER_SP_NAK_AL);
                        }

                        /* check SCL line */
                        scl_low_chk = false;
                        /* WAIT_LOOP */
                        for (cnt = RIIC_CFG_SCL_CHECK_COUNTER; (false == scl_low_chk) && (cnt > 0x00000000); cnt--)
                        {
                            if (RIIC_ICCR1_SCLI_SET != ((*piccr1_reg) & RIIC_ICCR1_SCLI)) /* SCL low ? */
                            {
                                scl_low_chk = true;
                            }
                        }

                        if (false == scl_low_chk) /* time out ? */
                        {
                            return RIIC_ERR_OTHER;
                        }

                        /* Generates the stop condition. */
                        riic_stop_cond_generate(p_riic_info);
                    }
                    else
                    {
                        /* Sets a write code. */
                        buf_send_data = (uint8_t) ((*(p_riic_info->p_slv_adr)) << 1U);
                        buf_send_data &= W_CODE;

                        /* Sets the internal status. */
                        riic_api_status_set(p_riic_info, RIIC_STS_SEND_SLVADR_W_WAIT);

                        /* Enables the IIC bus interrupt. */
                        /* Transmit data empty interrupt request is enabled. */
                        if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
                        {
                            if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                                    && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                            {
                                /* Enables slave send and slave receive */
                                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TEND_NAK_AL |
                                RIIC_ICIER_TX_RX);
                            }
                            else if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                                    && ((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data2nd))
                            {
                                /* Enable slave send */
                                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TEND_NAK_AL |
                                RIIC_ICIER_TX);
                            }
                            else if (((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data1st)
                                    && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                            {
                                /* Enable slave receive */
                                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TEND_NAK_AL |
                                RIIC_ICIER_RX);
                            }
                            else
                            {
                                /* Do Nothing */
                            }
                        }
                        else
                        {
                            riic_int_icier_setting(p_riic_info, RIIC_ICIER_TEND_NAK_AL);
                        }

                        /* Transmits the slave address. */
                        riic_set_sending_data(p_riic_info, &buf_send_data);
                    }
                break;

                    /* Previous status is data transfer completion waiting status. */
                case RIIC_STS_SEND_DATA_WAIT :

