renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
            /* Increases the 1st data buffer pointer. */
            p_riic_info->p_data1st++;
        }
        else
        {
            /* Transmits a "FFh" data. */
            riic_set_sending_data(p_riic_info, blank_data);
        }

    }

    return RIIC_SUCCESS;

} /* End of function riic_after_receive_slvadr() */

/***********************************************************************************************************************
 * Function Name: riic_write_data_sending
 * Description  : After Transmitting Data Processing.
 *                Performs one of the following processing  according to the state.
 *                Transmits a data. Generates stop condition. Generates restart condition.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, communication state
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_write_data_sending (riic_info_t * p_riic_info)
{
    riic_return_t ret = RIIC_SUCCESS;
    uint8_t blank_data[1] =
    { BLANK };

    /* IIC mode? */
    switch (riic_api_info[p_riic_info->ch_no].N_Mode)
    {
        case RIIC_MODE_M_SEND :

            /* Is 1st data pointer set? */
            if ((uint8_t *) FIT_NO_PTR != p_riic_info->p_data1st)
            {
                /* 1st data counter = 0?  */
                if (0x00000000 != p_riic_info->cnt1st) /* Pattern 1 of Master Write */
                {
                    /* Transmits a 1st data. */
                    riic_set_sending_data(p_riic_info, p_riic_info->p_data1st);

                    /* Decreases the 1st data counter. */
                    p_riic_info->cnt1st--;

                    /* Increases the 1st data buffer pointer. */
                    p_riic_info->p_data1st++;

                    break;
                }
            }

            /* Is 2nd data pointer set? */
            if ((uint8_t *) FIT_NO_PTR != p_riic_info->p_data2nd)
            {
                /* 2nd data counter = 0? */
                if (0x00000000 != p_riic_info->cnt2nd) /* Pattern 2 of Master Write */
                {
                    /* Transmits a 2nd data. */
                    riic_set_sending_data(p_riic_info, p_riic_info->p_data2nd);

                    /* Decreases the 2nd data counter. */
                    p_riic_info->cnt2nd--;

                    /* Increases the 2nd data buffer pointer. */
                    p_riic_info->p_data2nd++;

                    break;
                }
            }

            /* Sets the internal status. */
            riic_api_status_set(p_riic_info, RIIC_STS_SP_COND_WAIT);

            /* Enables the IIC bus interrupt. */
            riic_int_icier_setting(p_riic_info, RIIC_ICIER_SP_NAK_AL);

            /* Generates the stop condition. */
            riic_stop_cond_generate(p_riic_info);

        break;

        case RIIC_MODE_M_SEND_RECEIVE :

            /* Is 1st data pointer set? */
            if (0x00000000 != p_riic_info->cnt1st)
            {
                /* Transmits a 1st data. */
                riic_set_sending_data(p_riic_info, p_riic_info->p_data1st);

                /* Decreases the 1st data counter. */
                p_riic_info->cnt1st--;

                /* Increases the 1st data buffer pointer. */
                p_riic_info->p_data1st++;

                break;
            }

            /* Sets the internal status. */
            riic_api_status_set(p_riic_info, RIIC_STS_ST_COND_WAIT);

            /* Enables the IIC bus interrupt. */
            riic_int_icier_setting(p_riic_info, RIIC_ICIER_ST_NAK_AL);

            /* Restarts the condition generation */
            riic_re_start_cond_generate(p_riic_info);

        break;

        case RIIC_MODE_S_SEND :

            /* Is 1st data pointer set? */
            if ((uint8_t *) FIT_NO_PTR != p_riic_info->p_data1st)
            {
                /* 1st data counter = 0?  */
                if (0x00000000 != p_riic_info->cnt1st)
                {
                    /* Transmits a 1st data. */
                    riic_set_sending_data(p_riic_info, p_riic_info->p_data1st);

                    /* Decreases the 1st data counter. */
                    p_riic_info->cnt1st--;

                    /* Increases the 1st data buffer pointer. */
                    p_riic_info->p_data1st++;
                }
                else
                {
                    /* Transmits a "FFh" data. */
                    riic_set_sending_data(p_riic_info, blank_data);
                }
            }
            else
            {
                /* Transmits a "FFh" data. */
                riic_set_sending_data(p_riic_info, blank_data);
            }

        break;

        default :
            ret = RIIC_ERR_OTHER;
        break;
    }

    return ret;
} /* End of function riic_write_data_sending() */

/***********************************************************************************************************************
 * Function Name: riic_read_data_receiving
 * Description  : After Receiving Data Processing.
 *                Performs one of the following processing  according to the state.
 *                Receives a data. Generates stop condition.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, communication state
 **********************************************************************************************************************/
static riic_return_t riic_read_data_receiving (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    if (0x00000003 >= p_riic_info->cnt2nd)
    {
        /* The period between the ninth clock cycle and the first clock cycle is held low. */
        riic_receive_wait_setting(p_riic_info);
    }

    if (0x00000002 >= p_riic_info->cnt2nd)
    {
        /* Processing before receiving the "last byte - 1byte" in RX. */
        riic_receive_pre_end_setting(p_riic_info);
    }

