renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    if (0x00000001 >= p_riic_info->cnt2nd)
    {
        if (RIIC_MODE_S_RECEIVE != riic_api_info[p_riic_info->ch_no].N_Mode)
        {
            /* Sets the internal status. */
            riic_api_status_set(p_riic_info, RIIC_STS_SP_COND_WAIT);

            /* Enables the IIC bus interrupt. */
            riic_int_icier_setting(p_riic_info, RIIC_ICIER_SP_NAK_AL);

            /* Generates the stop condition. */
            riic_stop_cond_generate(p_riic_info);
        }

        if (0x00000000 != p_riic_info->cnt2nd)
        {
            /* Stores the received data. */
            *p_riic_info->p_data2nd = riic_get_receiving_data(p_riic_info);
            p_riic_info->cnt2nd--; /* Decreases the receiving data counter. */
            p_riic_info->p_data2nd++; /* Increases the receiving data buffer pointer. */
        }
        else
        {
            /* Performs dummy read. */
            uctmp = riic_get_receiving_data(p_riic_info);
        }

        /* Reception end setting */
        riic_receive_end_setting(p_riic_info);
    }
    else
    {
        /* Stores the received data. */
        *p_riic_info->p_data2nd = riic_get_receiving_data(p_riic_info);
        p_riic_info->cnt2nd--; /* Decreases the receiving data counter. */
        p_riic_info->p_data2nd++; /* Increases the receiving data buffer pointer. */
    }

    return RIIC_SUCCESS;
} /* End of function riic_read_data_receiving() */

/***********************************************************************************************************************
 * Function Name: riic_after_dtct_stop_cond
 * Description  : After Generating Stop Condition Processing.
 *                Checks bus busy.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, finished communication and idle state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy error
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                  ; Time out error
 **********************************************************************************************************************/
static riic_return_t riic_after_dtct_stop_cond (riic_info_t * p_riic_info)
{
    riic_return_t ret = RIIC_SUCCESS;
    bool boolret = RIIC_FALSE;
    volatile uint8_t * const picser_reg = RIIC_ICSER_ADR(p_riic_info->ch_no);

    /* Waits from "bus busy" to "bus ready". */
    boolret = riic_check_bus_busy(p_riic_info);
    if (RIIC_FALSE == boolret)
    {
        ret = RIIC_ERR_BUS_BUSY;
    }
    else
    {
        if (RIIC_TMO == g_riic_ChStatus[p_riic_info->ch_no])
        {
            ret = RIIC_ERR_TMO;
        }

        if (RIIC_AL == g_riic_ChStatus[p_riic_info->ch_no])
        {
            ret = RIIC_ERR_AL;
        }
    }

    if ((RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
            || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
    {
        /* Disable slave address1 */
        (*picser_reg) &= RIIC_ICSER_SAR_DASABLE;
    }

    return ret;
} /* End of function riic_after_dtct_stop_cond() */

/***********************************************************************************************************************
 * Function Name: riic_arbitration_lost
 * Description  : Arbitration Lost Error Processing. 
 *                Returns RIIC_ERR_AL.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                    ; Arbitration lost error
 **********************************************************************************************************************/
static riic_return_t riic_arbitration_lost (riic_info_t * p_riic_info)
{
    /* Checks the internal mode. */
    /* slave transfer not enable in now */
    if (((RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
    {
        /* slave transfer not enable in now and before */
        if ((((RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].B_Mode)
                || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                || (RIIC_MODE_NONE == riic_api_info[p_riic_info->ch_no].B_Mode))
        {
            /* Sets the internal status. */
            riic_api_status_set(p_riic_info, RIIC_STS_SP_COND_WAIT);

            /* Enables the IIC bus interrupt. */
            riic_int_icier_setting(p_riic_info, RIIC_ICIER_SP);

        }
        else if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
        {
            /* Initialize API status on RAM */
            riic_api_mode_event_init(priic_info_s[p_riic_info->ch_no], RIIC_MODE_S_READY);

            /* Sets the internal status. */
            riic_api_status_set(priic_info_s[p_riic_info->ch_no], RIIC_STS_AL);

            /* ---- Enables IIC bus interrupt enable register. ---- */
            if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                    && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
            {
                /* Enables slave send and slave receive */
                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TX_RX_SP_NAK);
            }
            else if (((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                    && ((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data2nd))
            {
                /* Enable slave send */
                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TX_SP_NAK);
            }
            else if (((uint8_t *) FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data1st)
                    && ((uint8_t *) FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
            {
                /* Enable slave receive */
                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_RX_SP);
            }
            else
            {
                /* Do Nothing */
            }
        }
        else
        {
            /* Do Nothing */
        }
    }

    /* slave transfer enable in now */
    else if ((RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
            || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
    {
        /* Do Nothing */
    }
    else
    {
        /* Do Nothing */
    }

