renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
 * Function Name: riic_set_ch_status
 * Description  : Updates the channel status.
 * Arguments    : riic_info_t * p_riic_info          ; IIC Information
 *              : riic_ch_dev_status_t status               ; channel status, device status
 * Return Value : None
 **********************************************************************************************************************/
static void riic_set_ch_status (riic_info_t * p_riic_info, riic_ch_dev_status_t status)
{
    /* Sets the channel status. */
    g_riic_ChStatus[p_riic_info->ch_no] = status;

    /* Sets the device status. */
    p_riic_info->dev_sts = status;
} /* End of function riic_set_ch_status() */

/***********************************************************************************************************************
 * Function Name: riic_check_chstatus_start
 * Description  : Check Channel Status Processing (at Start Function).
 *                When calls the starting function, checks the channel status.
 * Arguments    : riic_info_t * p_riic_info          ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_check_chstatus_start (riic_info_t * p_riic_info)
{
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);
    riic_return_t ret;

    /* Checks the channel status. */
    switch (g_riic_ChStatus[p_riic_info->ch_no])
    {
        case RIIC_NO_INIT :

            /* It is necessary to reinitialize. */
            /* Sets the return value to uninitialized state. */
            ret = RIIC_ERR_NO_INIT;
        break;

        case RIIC_IDLE :
        case RIIC_FINISH :
        case RIIC_NACK :

            /* Checks the device status. */
            if ((((RIIC_NO_INIT == p_riic_info->dev_sts) || (RIIC_IDLE == p_riic_info->dev_sts))
                    || (RIIC_FINISH == p_riic_info->dev_sts)) || (RIIC_NACK == p_riic_info->dev_sts))
            {
                /* Sets the return value to success state. */
                ret = RIIC_SUCCESS;
            }
            else if (RIIC_COMMUNICATION == p_riic_info->dev_sts)
            {
                /* Another device performed a driver reset processing
                 when this device is in idle state or communicating state. */
                /* It is necessary to reinitialize. */
                /* Sets the return value to bus busy state. */
                ret = RIIC_ERR_BUS_BUSY;
            }
            else if (RIIC_TMO == p_riic_info->dev_sts)
            {
                /* The device is in error state. */
                /* Sets the return value to time out error state. */
                ret = RIIC_ERR_TMO;
            }
            else if (RIIC_AL == p_riic_info->dev_sts)
            {
                /* The device is in error state. */
                /* Sets the return value to error state. */
                ret = RIIC_ERR_AL;
            }
            else
            {
                ret = RIIC_ERR_OTHER;
            }
        break;

        case RIIC_COMMUNICATION :

            /* The device or another device is on communication. */
            /* Sets the return value to communication state. */
            ret = RIIC_ERR_BUS_BUSY;
        break;

        case RIIC_TMO :

            /* The channel is in error state. */
            /* Sets the return value to time out error state. */
            ret = RIIC_ERR_TMO;
        break;

        case RIIC_AL :

            /* The channel is in error state. */
            /* Sets the return value to error state. */
            ret = RIIC_ERR_AL;
        break;

        default :
            ret = RIIC_ERR_OTHER;
        break;
    }

    if (RIIC_MSK_BBSY == ((*piccr2_reg) & RIIC_MSK_BBSY))
    {
        ret = RIIC_ERR_BUS_BUSY;
    }

    return ret;
} /* End of function riic_check_chstatus_start() */

/***********************************************************************************************************************
 * Function Name: riic_check_chstatus_advance
 * Description  : Check Channel Status Processing (at Advance Function).
 *                When calls the advance function, checks channel status.
 * Arguments    : riic_info_t * p_riic_info          ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_check_chstatus_advance (riic_info_t * p_riic_info)
{
    riic_return_t ret;

    /* Checks the channel status. */
    switch (g_riic_ChStatus[p_riic_info->ch_no])
    {
        case RIIC_NO_INIT :

            /* It is necessary to reinitialize. */
            /* Sets the return value to uninitialized state. */
            ret = RIIC_ERR_NO_INIT;
        break;

        case RIIC_IDLE :
        case RIIC_FINISH :
        case RIIC_NACK :

            /* Sets the return value to error state. */
            ret = RIIC_ERR_OTHER;
        break;

        case RIIC_COMMUNICATION :

            /* Checks the device status. */
            if ((((RIIC_NO_INIT == p_riic_info->dev_sts) || (RIIC_IDLE == p_riic_info->dev_sts))
                    || (RIIC_FINISH == p_riic_info->dev_sts)) || (RIIC_NACK == p_riic_info->dev_sts))
            {
                /* Sets the return value to idle state. */
                ret = RIIC_ERR_OTHER;
            }
            else if (RIIC_COMMUNICATION == p_riic_info->dev_sts)
            {
                /* The device or another device is on communication. */
                /* Sets the return value to communication state. */
                ret = RIIC_SUCCESS;
            }
            else if (RIIC_TMO == p_riic_info->dev_sts)
            {
                /* The device is in error state. */
                /* Sets the return value to time out error state. */
                ret = RIIC_ERR_TMO;
            }
            else if (RIIC_AL == p_riic_info->dev_sts)
            {
                /* The device is in error state. */
                /* Sets the return value to error state. */
                ret = RIIC_ERR_AL;
            }
            else
            {
                ret = RIIC_ERR_OTHER;
            }
        break;

