renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
        case RIIC_TMO :

            /* The channel is in time out error state. */
            /* Sets the return value to time out error state. */
            ret = RIIC_ERR_TMO;
        break;

        case RIIC_AL :

            /* The channel is in error state. */
            /* Sets the return value to error state. */
            ret = RIIC_ERR_AL;
        break;

        default :
            ret = RIIC_ERR_OTHER;
        break;
    }

    return ret;

} /* End of function riic_check_chstatus_advance() */

/***********************************************************************************************************************
 * Function Name: riic_enable
 * Description  : Enables IIC bus interrupt enable register.
 *              : Enables interrupt.
 *              : Enables IIC.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_enable (riic_info_t * p_riic_info)
{
    /* Initializes the IIC registers. */
    /* Includes I/O register read operation at the end of the following function. */
    riic_init_io_register(p_riic_info);

    /* Sets the internal status. */
    riic_api_status_set(p_riic_info, RIIC_STS_IDLE);

    /* Enables the interrupt. */
    riic_int_enable(p_riic_info);

    /* Clears the RIIC reset or internal reset. */
    riic_reset_clear(p_riic_info);
} /* End of function riic_enable() */

/***********************************************************************************************************************
 * Function Name: riic_disable
 * Description  : Disables IIC.
 *              : Disables interrupt.
 *              : Initializes IIC bus interrupt enable register.
 *              : Sets internal status.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_disable (riic_info_t * p_riic_info)
{
    /* Disables IIC. */
    /* Sets SCLn and SDAn to non-driven state. */
    /* Resets all RIIC registers and the internal status. (RIIC reset) */
    riic_all_reset(p_riic_info);

    /* Sets the internal mode. */
    riic_api_mode_event_init(p_riic_info, RIIC_MODE_NONE);

    /* Sets the internal status. */
    riic_api_status_set(p_riic_info, RIIC_STS_NO_INIT);

    /* Disables the interrupt. */
    riic_int_disable(p_riic_info);

    /* Clears the RIIC reset or internal reset. */
    riic_reset_clear(p_riic_info);
} /* End of function riic_disable() */

/***********************************************************************************************************************
 * Outline      : Initialize IIC Driver Processing
 * Function Name: riic_init_io_register
 * Description  : Initializes RIIC register.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_init_io_register (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psarl0_reg = RIIC_SARL0_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psaru0_reg = RIIC_SARU0_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psarl1_reg = RIIC_SARL1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psaru1_reg = RIIC_SARU1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psarl2_reg = RIIC_SARL2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psaru2_reg = RIIC_SARU2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picser_reg = RIIC_ICSER_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picmr2_reg = RIIC_ICMR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picmr3_reg = RIIC_ICMR3_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picfer_reg = RIIC_ICFER_ADR(p_riic_info->ch_no);

    /* Sets SCLn and SDAn to non-driven state. */
    /* Resets all RIIC registers and the internal status. (RIIC reset) */
    riic_all_reset(p_riic_info);

    /* Resets ICMR.BC, ICSR1, ICSR2, ICDRS registers and the internal status. (Internal reset) */
    (*piccr1_reg) |= RIIC_ICCR1_ICE_SET; /* Sets ICCR1.ICE bit to 1. */

    /* Sets slave address format and slave address. */
    *psarl0_reg = RIIC_SARL0_INIT; /* Sets SARLy and SARUy.(y=0,1,2) */
    *psaru0_reg = RIIC_SARU0_INIT; /* Sets SARLy and SARUy.(y=0,1,2) */
    *psarl1_reg = RIIC_SARL1_INIT; /* Sets SARLy and SARUy.(y=0,1,2) */
    *psaru1_reg = RIIC_SARU1_INIT; /* Sets SARLy and SARUy.(y=0,1,2) */
    *psarl2_reg = RIIC_SARL2_INIT; /* Sets SARLy and SARUy.(y=0,1,2) */
    *psaru2_reg = RIIC_SARU2_INIT; /* Sets SARLy and SARUy.(y=0,1,2) */
    *picser_reg = RIIC_ICSER_INIT; /* Sets ICSER register. */

    uctmp = *picser_reg; /* Reads ICSER. */

    /* Sets a transfer clock. */
    /* Includes I/O register read operation at the end of the following function. */
    riic_set_frequency(p_riic_info); /* Sets ICMR1.CKS[2:0] bit, ICBRL and ICBRH registers. */

    /* Initializes ICMR2 and ICMR3 registers. */
    *picmr2_reg = g_riic_icmr2_init[p_riic_info->ch_no];
    *picmr3_reg = g_riic_icmr3_init[p_riic_info->ch_no];

    /* Disables IIC interrupt. */
    riic_int_disable(p_riic_info);

#ifdef TN_RXA012A
    riic_timeout_counter_clear(p_riic_info->ch_no);
#endif

    /* Initializes ICFER register. */
    *picfer_reg = g_riic_icfer_init[p_riic_info->ch_no];
    uctmp = *picfer_reg; /* Reads ICFER. */
} /* End of function riic_init_io_register() */

/***********************************************************************************************************************
 * Function Name: riic_slv_addr_match_int_enable
 * Description  : Enable Slave Address Match Interrupt Processing.
 *                Enables slave address match interrupt.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_slv_addr_match_int_enable (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const psarl0_reg = RIIC_SARL0_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psaru0_reg = RIIC_SARU0_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psarl1_reg = RIIC_SARL1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psaru1_reg = RIIC_SARU1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psarl2_reg = RIIC_SARL2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psaru2_reg = RIIC_SARU2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picser_reg = RIIC_ICSER_ADR(p_riic_info->ch_no);

