renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    /* internal reset */
    riic_reset_set(p_riic_info);

    /* Enables slave address match interrupt. */
    if (1U == g_riic_slv_ad0_format[p_riic_info->ch_no])
    {
        /* 7bit address format setting */
        *psarl0_reg = g_riic_slv_ad0_val[p_riic_info->ch_no] << 1;
        *psaru0_reg = 0x00;
        (*picser_reg) |= RIIC_ICSER_SAR0E_SET;
    }
    else if (2U == g_riic_slv_ad0_format[p_riic_info->ch_no])
    {
        /* 10bit address format setting */
        *psarl0_reg = (uint8_t) (g_riic_slv_ad0_val[p_riic_info->ch_no] & RIIC_SARL_MASK);
        *psaru0_reg = (uint8_t) (((g_riic_slv_ad0_val[p_riic_info->ch_no] & RIIC_SARU_MASK) >> 7) |
        RIIC_SARU_10BIT_FORMAT_SET);
        (*picser_reg) |= RIIC_ICSER_SAR0E_SET;
    }
    else
    {
        /* Disable slave address0 */
        (*picser_reg) &= RIIC_ICSER_SAR0E_CLR;
    }

    if (1U == g_riic_slv_ad1_format[p_riic_info->ch_no])
    {
        /* 7bit address format setting */
        *psarl1_reg = (uint8_t) (g_riic_slv_ad1_val[p_riic_info->ch_no] << 1);
        *psaru1_reg = 0x00;
        (*picser_reg) |= RIIC_ICSER_SAR1E_SET;
    }
    else if (2U == g_riic_slv_ad1_format[p_riic_info->ch_no])
    {
        /* 10bit address format setting */
        *psarl1_reg = (uint8_t) (g_riic_slv_ad1_val[p_riic_info->ch_no] & RIIC_SARL_MASK);
        *psaru1_reg = (uint8_t) (((g_riic_slv_ad1_val[p_riic_info->ch_no] & RIIC_SARU_MASK) >> 7) |
        RIIC_SARU_10BIT_FORMAT_SET);
        (*picser_reg) |= RIIC_ICSER_SAR1E_SET;
    }
    else
    {
        /* Disable slave address1 */
        (*picser_reg) &= RIIC_ICSER_SAR1E_CLR;
    }

    if (1U == g_riic_slv_ad2_format[p_riic_info->ch_no])
    {
        /* 7bit address format setting */
        *psarl2_reg = (uint8_t) (g_riic_slv_ad2_val[p_riic_info->ch_no] << 1);
        *psaru2_reg = 0x00;
        (*picser_reg) |= RIIC_ICSER_SAR2E_SET;
    }
    else if (2 == g_riic_slv_ad2_format[p_riic_info->ch_no])
    {
        /* 10bit address format setting */
        *psarl2_reg = (uint8_t) (g_riic_slv_ad2_val[p_riic_info->ch_no] & RIIC_SARL_MASK);
        *psaru2_reg = (uint8_t) (((g_riic_slv_ad2_val[p_riic_info->ch_no] & RIIC_SARU_MASK) >> 7) |
        RIIC_SARU_10BIT_FORMAT_SET);
        (*picser_reg) |= RIIC_ICSER_SAR2E_SET;
    }
    else
    {
        /* Disable slave address2 */
        (*picser_reg) &= RIIC_ICSER_SAR2E_CLR;
    }

    if (1U == g_riic_gca_enable[p_riic_info->ch_no])
    {
        /* General call address setting */
        (*picser_reg) |= RIIC_ICSER_GCAE_SET;
    }
    else
    {
        /* Disable General call address */
        (*picser_reg) &= RIIC_ICSER_GCAE_CLR;
    }
    uctmp = *picser_reg; /* Reads ICSER. */

    /* Clears internal reset. */
    riic_reset_clear(p_riic_info);
} /* End of function riic_slv_addr_match_int_enable() */

/***********************************************************************************************************************
 * Function Name: riic_int_enable
 * Description  : Enable Interrupt Processing.
 *                Clears interrupt request register. Enables interrupt.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_int_enable (riic_info_t * p_riic_info)
{
    /* Clears the interrupt request register. */
    riic_clear_ir_flag(p_riic_info);

    /* Enable interrupts each target MCU.  */
    riic_mcu_int_enable(p_riic_info->ch_no);
} /* End of function riic_int_enable() */

/***********************************************************************************************************************
 * Function Name: riic_int_disable
 * Description  : Disable Interrupt Processing.
 *                Disables interrupt. Sets interrupt source priority. Clears interrupt request register.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_int_disable (riic_info_t * p_riic_info)
{
    /* Disable interrupts each target MCU.  */
    riic_mcu_int_disable(p_riic_info->ch_no);

    /* Clears the interrupt request register. */
    /* Includes I/O register read operation at the end of the following function. */
    riic_clear_ir_flag(p_riic_info);
} /* End of function riic_int_disable() */

/***********************************************************************************************************************
 * Function Name: riic_int_icier_setting
 * Description  : Set ICIER Register Processing.
 *                Sets an interrupt condition of RIIC.
 * Arguments    : riic_info_t *  p_riic_info     ; IIC Information
 : uint8_t        New_icier       ; New ICIER value
 * Return Value : None
 **********************************************************************************************************************/
static void riic_int_icier_setting (riic_info_t * p_riic_info, uint8_t New_icier)
{
    /* Setting TMOIE bit of interrupt enable register. */
    riic_mcu_int_icier_setting(p_riic_info->ch_no, New_icier);

} /* End of function riic_int_icier_setting() */

/***********************************************************************************************************************
 * Function Name: riic_set_frequency
 * Description  : Set IIC Frequency Processing. Sets ICMR1, ICBRL and ICBRH registers.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_set_frequency (riic_info_t * p_riic_info)
{
    riic_bps_calc(p_riic_info, g_riic_bps[p_riic_info->ch_no]); /* Set BPS */
} /* End of function riic_set_frequency() */

/***********************************************************************************************************************
 * Function Name: riic_check_bus_busy
 * Description  : Check Bus Busy Processing.
 *                When the bits of the RIIC registers are the following set values, the bus is released.
 *              :   ICCR2.BBSY = 0 ; The I2C bus is released (bus free state).
 *              :   ICCR1.SCLI = 1 ; SCLn pin input is at a high level.
 *              :   ICCR1.SDAI = 1 ; SDAn pin input is at a high level.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_TRUE                      ; Bus ready
 *              : RIIC_FALSE                     ; Bus busy
 **********************************************************************************************************************/
static bool riic_check_bus_busy (riic_info_t * p_riic_info)
{
    volatile uint32_t cnt = 0x00000000;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Checks bus busy. */
    /* WAIT_LOOP */
    for (cnt = RIIC_CFG_BUS_CHECK_COUNTER; cnt > 0x00000000; cnt--)
    {
        /* Bus busy? */
        if ((RIIC_MSK_BBSY != ((*piccr2_reg) & RIIC_MSK_BBSY)) && /* ICCR2.BBSY = 0 */
        (RIIC_MSK_SCLSDA == ((*piccr1_reg) & RIIC_MSK_SCLSDA))) /* ICCR1.SCLI = 1, ICCR1.SDAI = 1 */
        {
            return RIIC_TRUE; /* Bus ready */
        }
    }
    return RIIC_FALSE; /* Bus busy */
} /* End of function riic_check_bus_busy() */

