renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
 * Function Name: riic_start_cond_generate
 * Description  : Generate Start Condition Processing.
 *                Sets ICCR2.ST bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_start_cond_generate (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Clears start condition detection flag. */
    if (0x00 != (((*picsr2_reg) & RIIC_ICSR2_START_SET) >> 2U))
    {
        (*picsr2_reg) &= RIIC_ICSR2_START_CLR;
    }

    /* Generates a start condition. */
    (*piccr2_reg) |= RIIC_ICCR2_ST; /* Sets ICCR2.ST bit. */
    uctmp = *piccr2_reg; /* Reads ICCR2. */
} /* End of function riic_start_cond_generate() */

/***********************************************************************************************************************
 * Function Name: riic_re_start_cond_generate
 * Description  : Generate Restart Condition Processing.
 *                Sets ICCR2.RS bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_re_start_cond_generate (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Clears start condition detection flag. */
    if (0x00 != (((*picsr2_reg) & RIIC_ICSR2_START_SET) >> 2U))
    {
        (*picsr2_reg) &= RIIC_ICSR2_START_CLR;
    }

    /* Generates a restart condition. */
    (*piccr2_reg) |= RIIC_ICCR2_RS; /* Sets ICCR2.RS bit. */
    uctmp = *piccr2_reg; /* Reads ICCR2. */
} /* End of function riic_re_start_cond_generate() */

/***********************************************************************************************************************
 * Function Name: riic_stop_cond_generate
 * Description  : Generate Stop Condition Processing.
 *                Clears ICSR2.STOP bit and sets ICCR2.SP bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_stop_cond_generate (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Clears stop condition detection flag. */
    if (0x00 != (((*picsr2_reg) & RIIC_ICSR2_STOP_SET) >> 3U))
    {
        (*picsr2_reg) &= RIIC_ICSR2_STOP_CLR;
    }

    /* Generates a stop condition. */
    (*piccr2_reg) |= RIIC_ICCR2_SP; /* Sets ICCR2.SP bit. */
    uctmp = *piccr2_reg; /* Reads ICCR2. */
} /* End of function riic_stop_cond_generate() */

/***********************************************************************************************************************
 * Function Name: riic_set_sending_data
 * Description  : Transmit Data Processing.
 *                Sets transmission data to ICDRT register.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 *              : uint8_t *p_data                ; Transmitted data buffer pointer
 * Return Value : None
 **********************************************************************************************************************/
static void riic_set_sending_data (riic_info_t * p_riic_info, uint8_t *p_data)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picdrt_reg = RIIC_ICDRT_ADR(p_riic_info->ch_no);

    /* Clears TXI interrupt request register. */
    /* For the measure to keep the IR flag for the TXI interrupt from stocking twice,               */
    /* when the IR flag is 1 before writing data to the data buffer in the TXI interrupt handling,  */
    /* the IR flag is cleared before transmission.                                                  */
    /* This issue happens, for example, when the following three all occur.                         */
    /*  - An AL occurred during MasterSend.                                                         */
    /*  - In the communication with an AL occurred, the RX device is specified with SlaveSend       */
    /*    by the communication target Master.                                                       */
    /*  - The TXI interrupt handling is in wait state after receiving the address due to            */
    /*    another interrupt execution, etc.                                                         */
    riic_mcu_clear_ir_txi(p_riic_info->ch_no);

    /* Sets the transmitting data. */
    *picdrt_reg = *p_data; /* Writes data to RIIC in order to transmit. */
    uctmp = *picdrt_reg; /* Reads ICDRT. */
} /* End of function riic_set_sending_data() */

/***********************************************************************************************************************
 * Function Name: riic_get_receiving_data
 * Description  : Receive Data Prpcessing.
 *                Stores received data from ICDRR register.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : Returns received data.
 **********************************************************************************************************************/
static uint8_t riic_get_receiving_data (riic_info_t * p_riic_info)
{
    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picdrr_reg = RIIC_ICDRR_ADR(p_riic_info->ch_no);

