renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    /* Stores the received data. */
    return *picdrr_reg;
} /* End of function riic_get_receiving_data() */

/***********************************************************************************************************************
 * Function Name: riic_receive_wait_setting
 * Description  : Receive "last byte - 2bytes" Setting Proccesing.
 *                Sets ICMR3.WAIT bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_receive_wait_setting (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picmr3_reg = RIIC_ICMR3_ADR(p_riic_info->ch_no);

    /* Sets ICMR3.WAIT bit. */
    (*picmr3_reg) |= RIIC_ICMR3_WAIT_SET;
    uctmp = *picmr3_reg; /* Reads ICMR3. */
} /* End of function riic_receive_wait_setting() */

/***********************************************************************************************************************
 * Function Name: riic_receive_pre_end_setting
 * Description  : Receive "last byte - 1byte" Setting Proccesing.
 *                Sets ICMR3.RDRFS bit and ACKBT bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_receive_pre_end_setting (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picmr3_reg = RIIC_ICMR3_ADR(p_riic_info->ch_no);

    /* Sets ICMR3.RDRFS bit.*/
    (*picmr3_reg) |= RIIC_ICMR3_RDRFS_SET;

    /* Sets ICMR3.ACKBT bit. */
    (*picmr3_reg) |= RIIC_ICMR3_ACKWP_SET; /* Modification of the ACKBT bit is enabled.                */
    (*picmr3_reg) |= RIIC_ICMR3_ACKBT_SET; /* A 1 is sent as the acknowledge bit (NACK transmission).  */
    (*picmr3_reg) &= RIIC_ICMR3_ACKWP_CLR; /* Modification of the ACKBT bit is disabled.               */
    uctmp = *picmr3_reg; /* Reads ICMR3.                                             */
} /* End of function riic_receive_pre_end_setting() */

/***********************************************************************************************************************
 * Function Name: riic_receive_end_setting
 * Description  : Receive End Setting Processing.
 *                Sets ICMR3.ACKBT bit and clears ICMR3.WAIT bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_receive_end_setting (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picmr3_reg = RIIC_ICMR3_ADR(p_riic_info->ch_no);

    /* Sets ICMR3.ACKBT bit. */
    (*picmr3_reg) |= RIIC_ICMR3_ACKWP_SET; /* Modification of the ACKBT bit is enabled. */
    (*picmr3_reg) |= RIIC_ICMR3_ACKBT_SET;
    (*picmr3_reg) &= RIIC_ICMR3_ACKWP_CLR; /* Modification of the ACKBT bit is disabled. */

    /* Clears ICMR3.WAIT bit. */
    (*picmr3_reg) &= RIIC_ICMR3_WAIT_CLR;
    uctmp = *picmr3_reg; /* Reads ICMR3. */
} /* End of function riic_receive_end_setting() */

/***********************************************************************************************************************
 * Function Name: riic_reset_clear
 * Description  : Enable IIC Function Processing.
 *                Enables RIIC communication and enables RIIC multi-function pin controller.
 * Arguments    : riic_info_t * p_riic_info     ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_reset_clear (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);

    /* Enables RIIC. */
    (*piccr1_reg) &= RIIC_ICCR1_ENABLE; /* Clears ICCR1.IICRST bit. */
    uctmp = *piccr1_reg; /* Reads ICCR1. */
} /* End of function riic_reset_clear() */

/***********************************************************************************************************************
 * Function Name: riic_reset_set
 * Description  : Disable IIC Function Processing.
 *                Disables RIIC communication and disables RIIC multi-function pin controller.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_reset_set (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);

    /* Resets RIIC registers. */
    (*piccr1_reg) |= RIIC_ICCR1_RIIC_RESET; /* Sets ICCR1.IICRST bit. */
    uctmp = *piccr1_reg; /* Reads ICCR1. */
} /* End of function riic_reset_set() */

/***********************************************************************************************************************
 * Function Name: riic_all_reset
 * Description  : All reset IIC Function Processing.
 *                Resets all registers and internal states of the RIIC.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_all_reset (riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);

