renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    /* Resets RIIC registers. */
    (*piccr1_reg) &= RIIC_ICCR1_ICE_CLR; /* Clears ICCR1.ICE bit to 0. */
    (*piccr1_reg) |= RIIC_ICCR1_RIIC_RESET; /* Sets ICCR1.IICRST bit to 1. */

    uctmp = *piccr1_reg; /* Reads ICCR1. */
} /* End of function riic_all_reset() */

/***********************************************************************************************************************
 * Function Name: riic_clear_ir_flag
 * Description  : Clears Interrupt Request Flag Processing.
 *                Clears interrupt request register.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_clear_ir_flag (riic_info_t * p_riic_info)
{
    uint8_t internal_flag = 0x00; /* Determines whether reinitialization is necessary. */
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picier_reg = RIIC_ICIER_ADR(p_riic_info->ch_no);

    /* Checks IR flag. */
    /* If IR flag is set, clears IR flag. */
    if ((RIIC_IR_SET == riic_mcu_check_ir_txi(p_riic_info->ch_no))
            || (RIIC_IR_SET == riic_mcu_check_ir_rxi(p_riic_info->ch_no)))
    {
        /* Checks ICCR1.ICE bit. */
        if (RIIC_ICCR1_ICE_SET == ((*piccr1_reg) & RIIC_ICCR1_ICE)) /* ICCR1.ICE = 1 */
        {
            /* Sets return value. */
            internal_flag = 0x01;

            /* Clears ICCR1.ICE bit and sets ICCR1.IICRST bit. */
            (*piccr1_reg) |= RIIC_ICCR1_RIIC_RESET;
            /* WAIT_LOOP */
            while (RIIC_ICCR1_RIIC_RESET != ((*piccr1_reg) & RIIC_ICCR1_RIIC_RESET))
            {
                /* Do Nothing */
            }
            (*piccr1_reg) &= RIIC_ICCR1_ICE_CLR;
            /* WAIT_LOOP */
            while (RIIC_ICCR1_NOT_DRIVEN != ((*piccr1_reg) & RIIC_ICCR1_ICE))
            {
                /* Do Nothing */
            }
        }

        /* Initializes ICIER register. */
        *picier_reg = RIIC_ICIER_INIT;
        /* WAIT_LOOP */
        while (RIIC_ICIER_INIT != (*picier_reg))
        {
            /* Do Nothing */
        }

        riic_mcu_clear_ir_rxi(p_riic_info->ch_no); /* Clears RXI interrupt request register. */
        riic_mcu_clear_ir_txi(p_riic_info->ch_no); /* Clears TXI interrupt request register. */

        /* Checks the need of the reinitialization. */
        if (0x01 == internal_flag)
        {
            internal_flag = 0x00;

            /* Reinitializes RIIC register because cleared ICCR1.ICE bit. */
            /* Includes I/O register read operation at the end of the following function. */
            riic_init_io_register(p_riic_info);
        }
    }
} /* End of function riic_clear_ir_flag() */

/***********************************************************************************************************************
 * Function Name: riic_bps_calc
 * Description  : Calculation for ICBRH and ICBRL registers value
 *              :  and CKS bits value from setting bps of the argument.
 *              :
 * Arguments    : riic_info_t * p_riic_info      ; IIC Informationu
 *              : uint16_t kbps                  ; bit rate(kHz)
 * Return Value : RIIC_SUCCESS                   ; Successful operation, communication state
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_bps_calc (riic_info_t * p_riic_info, uint16_t kbps)
{
    volatile uint8_t uctmp;
    volatile uint8_t * const picmr1_reg = RIIC_ICMR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picbrl_reg = RIIC_ICBRL_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picbrh_reg = RIIC_ICBRH_ADR(p_riic_info->ch_no);
    
    uint8_t uctmp_tmp;

    const double scl100k_up_time = 1000E-9;
    const double scl100k_down_time = 300E-9;
    const double scl400k_up_time = 300E-9;
    const double scl400k_down_time = 300E-9;
    const double scl1m_up_time = 120E-9;
    const double scl1m_down_time = 120E-9;

    const uint8_t d_cks[RIIC_MAX_DIV] =
    { 1, 2, 4, 8, 16, 32, 64, 128 }; /* divider array of RIIC clock  */
    double pclk_val;

    volatile double bps = (double) (kbps * 1000);
    volatile double L_time; /* H Width period */
    volatile double H_time; /* L Width period */
    
    double bps_tmp;

    volatile double calc_val; /* Using for calculation buffer */
    
    double calc_val_tmp;

    double scl_up_time;
    double scl_down_time;
    volatile uint8_t cnt;

    pclk_val = riic_mcu_check_freq(); /* Store pclk frequency */

    /* Set Rise up time and down time */
    if (kbps > RIIC_FAST_SPPED_MAX)
    {
        /* When bps more than 400Kbps[Fast mode plus] */
        scl_up_time = scl1m_up_time;
        scl_down_time = scl1m_down_time;
    }
    else if (kbps > RIIC_STAD_SPPED_MAX)
    {
        /* When bps more than 100Kbps[Fast mode] */
        scl_up_time = scl400k_up_time;
        scl_down_time = scl400k_down_time;
    }
    else
    {
        /* When bps less than 100Kbps[Standard mode] */
        scl_up_time = scl100k_up_time;
        scl_down_time = scl100k_down_time;
    }

    /* Calculation for ICBRH and ICBRL registers value */

    /* Calculation L width time */
    L_time = (1 / (2 * bps)); /* Harf period of frequency */
    H_time = L_time;

    /* Check I2C mode of Speed */
    if (kbps > RIIC_FAST_SPPED_MAX)
    {
        /* 400kbps over */
        /* Check L width */
        if (L_time < 0.5E-6)
        {
            /* Wnen L width less than 0.5us */
            /* Subtract Rise up and down time for SCL from H/L width */
            L_time = 0.5E-6;
            bps_tmp = bps;
            H_time = (((1 / bps_tmp) - L_time) - scl_up_time) - scl_down_time;
        }
        else
        {
            /* Subtract Rise up and down time for SCL from H/L width */
            L_time -= scl_down_time;
            H_time -= scl_up_time;
        }
    }
    else if (kbps > RIIC_STAD_SPPED_MAX)
    {
        /* 100kbps over */
        /* Check L width */
        if (L_time < 1.3E-6)
        {
            /* Wnen L width less than 1.3us */
            /* Subtract Rise up and down time for SCL from H/L width */
            L_time = 1.3E-6;
            bps_tmp = bps;
            H_time = (((1 / bps_tmp) - L_time) - scl_up_time) - scl_down_time;
        }
        else
        {
            /* Subtract Rise up and down time for SCL from H/L width */
            L_time -= scl_down_time;
            H_time -= scl_up_time;
        }
    }
    else
    {
        /* less than 100kbps */
/* Since the L width is calculated based on the half period of frequency above, it is always larger than 4.7 us
   at 100 kbps or less. Comment out the following branch processing.
         * Check L width *
        if (L_time < 4.7E-6)
        {
            * Wnen L width less than 4.7us *
            * Subtract Rise up and down time for SCL from H/L width *
            L_time = 4.7E-6;
            H_time = (((1 / bps) - L_time) - scl_up_time) - scl_down_time;
        }
        else
        {
 */
        /* Subtract Rise up and down time for SCL from H/L width */
        L_time -= scl_down_time;
        H_time -= scl_up_time;

/*      }*/
    }

    /*************** Calculation ICBRL value ***********************/
    /* Calculating until calc_val is less than 32 */
    /* WAIT_LOOP */
    for (calc_val = 0xFF, cnt = 0; RIIC_ICBR_MAX < calc_val; cnt++)
    {
        calc_val = L_time; /* Set L width time */

