renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    switch(riic_api_info[2].N_Mode)
    {
        case RIIC_MODE_M_SEND :
        case RIIC_MODE_M_RECEIVE :
        case RIIC_MODE_M_SEND_RECEIVE :

            /* Master mode data */
            p_riic_info = priic_info_m[2];
        break;

        case RIIC_MODE_S_READY :
        case RIIC_MODE_S_SEND :
        case RIIC_MODE_S_RECEIVE :

            /* Slave mode data */
            p_riic_info = priic_info_s[2];
        break;

        default :

            /* Internal error */
            return;
        break;
    }

    r_riic_advance(p_riic_info); /* Calls advance function */
} /* End of function riic2_eei_sub() */

/***********************************************************************************************************************
 * Function Name: riic2_txi_sub
 * Description  : Interrupt TXI handler for channel 2.
 *                Types of interrupt requests transmission data empty.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic2_txi_sub (void)
{
    uint8_t tmp;

    #ifdef TN_RXA012A
    riic_timeout_counter_clear(2);
    #endif

    /* TXI processing is performed only when the following conditions are all met.                 */
    /*  - The address part of data has been received and the received address matches the RX's     */
    /*    own address.                                                                             */
    /*  - The RX device is in slave mode.                                                          */
    /*  - The RX device is in transmission mode (the R/W bit received is 'R' (slave transmission)) */
    tmp = RIIC2.ICCR2.BYTE;
    if ((RIIC_ICCR2_MST_SET != (tmp & RIIC_ICCR2_MST)) && (RIIC_ICCR2_TRS_SET == (tmp & RIIC_ICCR2_TRS)))
    {
        /* Processing when the addresses match (slave send specified) */

        /* Determines whether the state is arbitration-lost detected.                           */
        /* When an arbitration-lost is detected, the riic_after_receive_slvadr function is not  */
        /* executed. Thus the internal status needs to be changed to "RIIC_STS_SEND_DATA_WAIT". */
        if (RIIC_STS_AL == riic_api_info[2].N_status)
        {
            /* Processing when an arbitration-lost is detected. */
            /* Sets the internal status. */
            riic_api_status_set(priic_info_s[2], RIIC_STS_SEND_DATA_WAIT);
        }

        /* Determines if the slave transmission is the first slave transmission.             */
        /* N_mode is updated from "RIIC_MODE_S_READY" to "RIIC_MODE_S_SEND" on the first TXI */
        /* interrupt after the slave transmission is determined.                             */
        if (RIIC_MODE_S_READY == riic_api_info[2].N_Mode)
        {
            /* Processing for the first slave transmission */
            /* Sets the internal mode. */
            riic_api_info[2].N_Mode = RIIC_MODE_S_SEND; /* Set slave transmission mode. */
        }

        /* Sets event. */
        switch (riic_api_info[2].N_status)
        {
            case RIIC_STS_IDLE_EN_SLV :

                /* Updates the channel status. */
                riic_set_ch_status(priic_info_s[2], RIIC_COMMUNICATION);

                /* Sets interrupted address sending. */
                riic_api_event[2] = RIIC_EV_INT_ADD;

            break;

            case RIIC_STS_SEND_DATA_WAIT :

                /* Sets interrupted data sending. */
                riic_api_event[2] = RIIC_EV_INT_SEND;

            break;

            default :

                /* Does nothing. */
            break;

        }

        r_riic_advance(priic_info_s[2]); /* Calls advance function */

    }
} /* End of function riic2_txi_sub() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: riic2_rxi_sub
 * Description  : Interrupt RXI handler for channel 2.
 *                Types of interrupt requests reception end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic2_rxi_sub (void)
{
    riic_info_t * p_riic_info;

    #ifdef TN_RXA012A
    riic_timeout_counter_clear(2);
    #endif

    if (RIIC_STS_AL == riic_api_info[2].N_status)
    {
        /* Sets the internal status. */
        riic_api_status_set(priic_info_s[2], RIIC_STS_IDLE_EN_SLV);
    }

    if (RIIC_MODE_S_READY == riic_api_info[2].N_Mode)
    {
        /* Sets the internal mode. */
        riic_api_info[2].N_Mode = RIIC_MODE_S_RECEIVE;
    }

    if ((RIIC_STS_IDLE_EN_SLV == riic_api_info[2].N_status))
    {
        /* Updates the channel status. */
        riic_set_ch_status(priic_info_s[2], RIIC_COMMUNICATION);
    }

    switch (riic_api_info[2].N_Mode)
    {
        case RIIC_MODE_M_RECEIVE :
        case RIIC_MODE_M_SEND_RECEIVE :

            /* Master mode data */
            p_riic_info = priic_info_m[2];
        break;

        case RIIC_MODE_S_RECEIVE :

            /* Slave mode data */
            p_riic_info = priic_info_s[2];
        break;

        default :

            /* Internal error */
            return;
        break;
    }

    /* Sets interrupted data receiving. */
    riic_api_event[2] = RIIC_EV_INT_RECEIVE;

    r_riic_advance(p_riic_info); /* Calls advance function */
} /* End of function riic2_rxi_sub() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: riic2_tei_sub
 * Description  : Interrupt TEI handler for channel 2.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic2_tei_sub (void)
{
    #ifdef TN_RXA012A
    riic_timeout_counter_clear(2);
    #endif

    /* Clears ICSR2.TEND. */
    RIIC2.ICSR2.BIT.TEND = 0U;
    /* WAIT_LOOP */
    while (0U != RIIC2.ICSR2.BIT.TEND)
    {
        /* Do Nothing */
    }

