renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_riic_rx/src/r_riic_rx.c
    /* Sets event. */
    switch (riic_api_info[2].N_status)
    {
        case RIIC_STS_SEND_SLVADR_W_WAIT :
        case RIIC_STS_SEND_SLVADR_R_WAIT :

            /* Sets interrupted address sending. */
            riic_api_event[2] = RIIC_EV_INT_ADD;

        break;

        case RIIC_STS_SEND_DATA_WAIT :

            /* Sets interrupted data sending. */
            riic_api_event[2] = RIIC_EV_INT_SEND;

        break;

        default :

            /* Does nothing. */
        break;

    }

    r_riic_advance(priic_info_m[2]); /* Calls advance function */
} /* End of function riic2_tei_sub() */
#endif

/***********************************************************************************************************************
 * Function Name: riic_timeout_counter_clear
 * Description  : Technical update No.TN-RX*-A012A process.
 *                Time out internal counter clear.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
#ifdef TN_RXA012A
static void riic_timeout_counter_clear (uint8_t channel)
{
    volatile uint8_t * const picmr2_reg = RIIC_ICMR2_ADR(channel);
    volatile uint8_t * const ptmocntl_reg = RIIC_TMOCNTL_ADR(channel);
    volatile uint8_t * const ptmocnth_reg = RIIC_TMOCNTH_ADR(channel);

    /* time out internal counter write enable */
    (*picmr2_reg) |= RIIC_ICMR2_TMWE_SET;
    if (RIIC_ICMR2_TMWE == ((*picmr2_reg) & RIIC_ICMR2_TMWE))
    {
        /* Do Nothing */
    }

    /* time out iternal counter clear */
    (*ptmocntl_reg) = 0x00;
    (*ptmocnth_reg) = 0x00;
    if (0xFF == (*ptmocnth_reg))
    {
        /* Do Nothing */
    }

    /* time out internal counter write disable */
    (*picmr2_reg) &= RIIC_ICMR2_TMWE_CLR;
    if (0x00 == ((*picmr2_reg) & RIIC_ICMR2_TMWE))
    {
        /* Do Nothing */
    }
} /* End of function riic_timeout_counter_clear() */
#endif

